
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       5 |          4 |           3 |
## Affected resources by action

|  Action  | Resources                                                                                  |
|:--------:|:-------------------------------------------------------------------------------------------|
|    🟢     | `module.jumphost.aws_iam_policy.required`                                                  |
|    🟢     | `module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["required"]` |
|    🟡     | `module.jumphost.aws_autoscaling_group.jumphost`                                           |
|    🟡     | `module.jumphost.aws_iam_policy.lambda_permissions`                                        |
|    🟡     | `module.jumphost.aws_lambda_function.update_dns`                                           |
|    🟡     | `module.jumphost.aws_launch_template.jumphost`                                             |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/2a9fcae5-f3df-4d09-97f8-18c481cbfb2e/terraform-bin plan -no-color --out=tf.plan
data.terraform_remote_state.cicd: Reading...
module.jumphost.null_resource.install_python_dependencies: Refreshing state... [id=4129585096758259745]
module.release_infrahouse_com["jammy"].random_password.passphrase: Refreshing state... [id=none]
module.release_infrahouse_com["focal"].random_password.passphrase: Refreshing state... [id=none]
module.jumphost.random_uuid.lamda_src_hash: Refreshing state... [id=3aa738f0-227d-6f06-11a5-c1754428cbdb]
module.release_infrahouse_com["jammy"].aws_acm_certificate.repo: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/402852e1-7054-4cea-80ac-3ccbee72a398]
module.release_infrahouse_com["focal"].aws_acm_certificate.repo: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/2eed53d3-e1ad-4743-ace5-89c193cd3c65]
data.aws_ami.ubuntu_22: Reading...
module.jumphost.aws_s3_bucket.lambda_tmp: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]
module.release_infrahouse_com["focal"].aws_s3_bucket.repo: Refreshing state... [id=infrahouse-release-focal]
module.jumphost.data.aws_region.current: Reading...
module.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...
module.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...
module.jumphost.data.aws_ami.ubuntu: Reading...
module.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]
module.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=2218315402]
module.release_infrahouse_com["jammy"].aws_s3_bucket.repo: Refreshing state... [id=infrahouse-release-jammy]
module.jumphost.module.jumphost_userdata.data.aws_region.current: Reading...
module.release_infrahouse_com["jammy"].aws_secretsmanager_secret.key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-jammy-XrTWrP]
module.jumphost.module.jumphost_userdata.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Reading...
module.release_infrahouse_com["jammy"].aws_s3_bucket.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs]
module.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]
module.release_infrahouse_com["jammy"].aws_cloudfront_cache_policy.default: Refreshing state... [id=b04aff45-48e1-4501-90d3-998c9fa1f264]
data.aws_ami.ubuntu_22: Read complete after 1s [id=ami-0f324e1cd5c4465c8]
module.release_infrahouse_com["focal"].aws_secretsmanager_secret.key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-focal-XrTWrP]
module.jumphost.data.aws_iam_policy_document.assume_role: Reading...
module.jumphost.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.release_infrahouse_com["focal"].aws_s3_bucket.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs]
module.jumphost.data.aws_ami.ubuntu: Read complete after 1s [id=ami-0f324e1cd5c4465c8]
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]
data.aws_availability_zones.uw1: Reading...
module.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy.admin: Reading...
module.release_infrahouse_com["focal"].aws_cloudfront_cache_policy.default: Refreshing state... [id=5db494dd-546b-4231-a0c7-133b245ada49]
data.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]
module.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=1585346832]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.admin: Reading...
module.release_infrahouse_com["jammy"].aws_secretsmanager_secret.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG]
module.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.release_infrahouse_com["focal"].aws_secretsmanager_secret.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq]
data.terraform_remote_state.cicd: Read complete after 2s
module.jumphost.data.aws_caller_identity.current: Reading...
data.aws_iam_policy.administrator-access: Reading...
module.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]
aws_key_pair.aleks: Refreshing state... [id=aleks]
module.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=83731904]
module.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost20230710043044761000000002]
module.jumphost.module.jumphost_userdata.data.cloudinit_config.config: Reading...
module.jumphost.module.jumphost_userdata.data.cloudinit_config.config: Read complete after 0s [id=1671431378]
module.jumphost.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]
module.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy.admin: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.admin: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]
module.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]
data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-infrahouse-website-infra-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::493370826424:policy/ih-tf-infrahouse-website-infra-github]
data.aws_route53_zone.cicd-ih-com: Reading...
module.release_infrahouse_com["jammy"].aws_secretsmanager_secret_version.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG|D6ABCB2B-F850-4487-A764-07263736323E]
module.release_infrahouse_com["focal"].aws_secretsmanager_secret_version.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq|6586EB13-79C2-424D-AFED-6810E61156D7]
module.ih-tf-aws-control-493370826424-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::493370826424:policy/ih-tf-aws-control-493370826424-github]
module.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost20230710043044760400000001]
module.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost]
module.jumphost.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole: Refreshing state... [id=iam_for_lambda-20230710175434878000000001]
data.aws_iam_policy_document.puppet-code-github-assume: Reading...
data.aws_iam_policy_document.puppet-code-github-assume: Read complete after 0s [id=1695170656]
data.aws_iam_policy_document.infrahouse-com-github-assume: Reading...
data.aws_iam_policy_document.infrahouse-com-github-assume: Read complete after 0s [id=1754214164]
data.aws_iam_policy_document.github-assume: Reading...
data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3592205772]
module.jumphost.aws_s3_object.lambda_package: Refreshing state... [id=3aa738f0-227d-6f06-11a5-c1754428cbdb.zip]
module.jumphost.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]
module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=jumphost20230710043044761000000002-20230810155721624300000001]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]
module.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=709841391]
aws_iam_role.puppet-code-github: Refreshing state... [id=puppet-code-github]
aws_iam_role.infrahouse-com-github: Refreshing state... [id=infrahouse-com-github]
aws_iam_role.infrahouse-toolkit-github: Refreshing state... [id=infrahouse-toolkit-github]
module.jumphost.data.aws_route53_zone.jumphost_zone: Reading...
module.release_infrahouse_com["jammy"].aws_route53_record.cert_validation["release-jammy.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__047ae29925ec0297eaebfeddc886f234.release-jammy.infrahouse.com._CNAME]
module.release_infrahouse_com["focal"].aws_route53_record.cert_validation["release-focal.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__87f2ead3abf68134c497bf52718e07b1.release-focal.infrahouse.com._CNAME]
module.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]
module.ih-tf-infrahouse-website-infra-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-infrahouse-website-infra-github]
module.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]
module.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]
module.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]
module.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]
module.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]
module.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-01a8ef96822b4b00b]
data.aws_route53_zone.cicd-ih-com: Read complete after 0s [id=Z06790082OU0POPWOCPZ4]
module.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]
module.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]
module.release_infrahouse_com["jammy"].aws_s3_bucket_ownership_controls.repo: Refreshing state... [id=infrahouse-release-jammy]
module.release_infrahouse_com["focal"].aws_s3_bucket_ownership_controls.repo: Refreshing state... [id=infrahouse-release-focal]
module.release_infrahouse_com["jammy"].data.aws_iam_policy_document.public-access: Reading...
module.jumphost.data.aws_route53_zone.jumphost_zone: Read complete after 1s [id=Z07662251LH3YRF2ERM3G]
module.release_infrahouse_com["jammy"].data.aws_iam_policy_document.public-access: Read complete after 0s [id=4184171728]
module.release_infrahouse_com["focal"].data.aws_iam_policy_document.public-access: Reading...
module.release_infrahouse_com["jammy"].aws_s3_object.distributions: Refreshing state... [id=conf/distributions]
module.release_infrahouse_com["focal"].data.aws_iam_policy_document.public-access: Read complete after 0s [id=1693473946]
module.release_infrahouse_com["focal"].aws_s3_object.distributions: Refreshing state... [id=conf/distributions]
module.release_infrahouse_com["jammy"].aws_s3_bucket_public_access_block.repo: Refreshing state... [id=infrahouse-release-jammy]
module.release_infrahouse_com["focal"].aws_s3_bucket_public_access_block.repo: Refreshing state... [id=infrahouse-release-focal]
module.release_infrahouse_com["jammy"].aws_s3_bucket_website_configuration.repo: Refreshing state... [id=infrahouse-release-jammy]
module.release_infrahouse_com["focal"].aws_s3_bucket_website_configuration.repo: Refreshing state... [id=infrahouse-release-focal]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github-20230817010818258200000001]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2899629952]
module.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2714260376]
module.ih-tf-infrahouse-website-infra-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-infrahouse-website-infra-github-20230818034150993400000001]
aws_route53_record.ci-cd-ns: Refreshing state... [id=Z07662251LH3YRF2ERM3G_ci-cd.infrahouse.com_NS]
module.release_infrahouse_com["jammy"].aws_s3_bucket_ownership_controls.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs]
module.release_infrahouse_com["focal"].aws_s3_bucket_ownership_controls.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs]
module.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]
module.jumphost.aws_lambda_function.update_dns: Refreshing state... [id=update_dns]
module.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]
module.release_infrahouse_com["jammy"].aws_acm_certificate_validation.repo: Refreshing state... [id=2023-07-24 18:51:39.051 +0000 UTC]
module.release_infrahouse_com["focal"].aws_acm_certificate_validation.repo: Refreshing state... [id=2023-07-24 18:51:39.442 +0000 UTC]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]
module.ih-tf-infrahouse-website-infra-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-infrahouse-website-infra-admin]
module.release_infrahouse_com["jammy"].aws_s3_bucket_acl.repo: Refreshing state... [id=infrahouse-release-jammy,public-read]
module.release_infrahouse_com["focal"].aws_s3_bucket_acl.repo: Refreshing state... [id=infrahouse-release-focal,public-read]
module.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]
module.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]
module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]
module.release_infrahouse_com["jammy"].aws_s3_bucket_acl.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs,private]
module.release_infrahouse_com["focal"].aws_s3_bucket_acl.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs,private]
module.release_infrahouse_com["jammy"].aws_cloudfront_distribution.repo: Refreshing state... [id=E1IILWIY0OU78B]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]
module.ih-tf-infrahouse-website-infra-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-infrahouse-website-infra-admin-20230818034158985100000002]
module.release_infrahouse_com["focal"].aws_cloudfront_distribution.repo: Refreshing state... [id=E161QGCPE3JIOK]
module.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20230710045512165400000001]
module.release_infrahouse_com["jammy"].aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-release-jammy]
module.release_infrahouse_com["focal"].aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-release-focal]
module.release_infrahouse_com["jammy"].aws_s3_object.index-html: Refreshing state... [id=index.html]
module.release_infrahouse_com["focal"].aws_s3_object.index-html: Refreshing state... [id=index.html]
module.release_infrahouse_com["focal"].aws_s3_object.deb-gpg-public-key: Refreshing state... [id=DEB-GPG-KEY-release-focal.infrahouse.com]
module.release_infrahouse_com["jammy"].aws_s3_object.deb-gpg-public-key: Refreshing state... [id=DEB-GPG-KEY-release-jammy.infrahouse.com]
module.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]
module.release_infrahouse_com["jammy"].aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_release-jammy.infrahouse.com_A]
module.release_infrahouse_com["focal"].aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_release-focal.infrahouse.com_A]
module.jumphost.aws_lambda_function_event_invoke_config.update_dns: Refreshing state... [id=update_dns]
module.jumphost.aws_cloudwatch_log_group.update_dns: Refreshing state... [id=/aws/lambda/update_dns]
module.jumphost.aws_cloudwatch_event_rule.scale: Refreshing state... [id=jumphost-scale20230711172747504700000001]
module.jumphost.aws_autoscaling_lifecycle_hook.launching: Refreshing state... [id=launching]
module.jumphost.aws_autoscaling_lifecycle_hook.terminating: Refreshing state... [id=terminating]
module.jumphost.aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_permissions20230711160512724200000001]
module.jumphost.aws_iam_role_policy_attachment.lambda_permissions: Refreshing state... [id=iam_for_lambda-20230711160513416100000002]
data.aws_iam_policy_document.package-publisher: Reading...
data.aws_iam_policy_document.package-publisher: Read complete after 0s [id=4050006037]
aws_iam_policy.package-publisher: Refreshing state... [id=arn:aws:iam::493370826424:policy/package-publisher]
aws_iam_role_policy_attachment.infrahouse-toolkit-github: Refreshing state... [id=infrahouse-toolkit-github-20230728211642836200000001]
aws_iam_role_policy_attachment.puppet-code-github: Refreshing state... [id=puppet-code-github-20230807171249209900000001]
aws_iam_role_policy_attachment.infrahouse-com-github: Refreshing state... [id=infrahouse-com-github-20230819214139756300000001]
module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["package-publisher"]: Refreshing state... [id=jumphost20230710043044761000000002-20230724185614710700000003]
module.jumphost.data.aws_iam_policy_document.lambda_logging: Reading...
module.jumphost.data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=1511413075]
module.jumphost.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_logging20230711160513778300000003]
module.jumphost.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=iam_for_lambda-20230711160514251100000004]
module.jumphost.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch-out]
module.jumphost.aws_cloudwatch_event_target.scale-out: Refreshing state... [id=jumphost-scale20230711172747504700000001-terraform-20230711172747630900000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.jumphost.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/jumphost/update_dns"
      + type                = "zip"
    }

  # module.jumphost.data.aws_iam_policy_document.lambda-permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:CompleteLifecycleAction",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:01326e36-8363-42a8-b06d-f0d8d848a727:autoScalingGroupName/jumphost-20230710045512165400000001",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
              + "ec2:DescribeTags",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
            ]
          + resources = [
              + "arn:aws:ec2:*:493370826424:instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "route53:ChangeResourceRecordSets",
              + "route53:ListResourceRecordSets",
            ]
          + resources = [
              + "arn:aws:route53:::hostedzone/Z07662251LH3YRF2ERM3G",
            ]
        }
    }

  # module.jumphost.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:01326e36-8363-42a8-b06d-f0d8d848a727:autoScalingGroupName/jumphost-20230710045512165400000001",
            ]
        }
    }

  # module.jumphost.aws_autoscaling_group.jumphost will be updated in-place
  ~ resource "aws_autoscaling_group" "jumphost" {
        id                               = "jumphost-20230710045512165400000001"
        name                             = "jumphost-20230710045512165400000001"
        # (27 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-01a8ef96822b4b00b"
            name    = "jumphost-20230710044926605800000001"
          ~ version = "28" -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.jumphost.aws_iam_policy.lambda_permissions will be updated in-place
  ~ resource "aws_iam_policy" "lambda_permissions" {
        id          = "arn:aws:iam::493370826424:policy/lambda_permissions20230711160512724200000001"
        name        = "lambda_permissions20230711160512724200000001"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:CompleteLifecycleAction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:01326e36-8363-42a8-b06d-f0d8d848a727:autoScalingGroupName/jumphost-20230710045512165400000001"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeTags",
                          - "ec2:DescribeInstances",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ec2:CreateTags"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ec2:*:493370826424:instance/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "route53:ListResourceRecordSets",
                          - "route53:ChangeResourceRecordSets",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::hostedzone/Z07662251LH3YRF2ERM3G"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.jumphost.aws_iam_policy.required will be created
  + resource "aws_iam_policy" "required" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.jumphost.aws_lambda_function.update_dns will be updated in-place
  ~ resource "aws_lambda_function" "update_dns" {
        id                             = "update_dns"
      ~ last_modified                  = "2023-08-02T23:12:52.281+0000" -> (known after apply)
      ~ s3_key                         = "3aa738f0-227d-6f06-11a5-c1754428cbdb.zip" -> (known after apply)
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.jumphost.aws_launch_template.jumphost will be updated in-place
  ~ resource "aws_launch_template" "jumphost" {
        id                      = "lt-01a8ef96822b4b00b"
      ~ latest_version          = 28 -> (known after apply)
        name                    = "jumphost-20230710044926605800000001"
        tags                    = {}
      ~ user_data               = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gLSAiaWgtcHVwcGV0IgogIC0gIi0tZGVidWciCiAgLSAiYXBwbHkiCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiB8LQogICAgW2RlZmF1bHRdCiAgICByZWdpb249dXMtd2VzdC0xCiAgInBhdGgiOiAiL3Jvb3QvLmF3cy9jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2MDAiCi0gImNvbnRlbnQiOiB8CiAgICAicHVwcGV0X2Vudmlyb25tZW50IjogInByb2R1Y3Rpb24iCiAgICAicHVwcGV0X3JvbGUiOiAianVtcGhvc3QiCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL3B1cHBldC55YW1sIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgoNCi0tTUlNRUJPVU5EQVJZLS0NCg==" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gLSAiaWgtcHVwcGV0IgogIC0gIi0tZW52aXJvbm1lbnQiCiAgLSAicHJvZHVjdGlvbiIKICAtICItLXJvb3QtZGlyZWN0b3J5IgogIC0gIi9vcHQvcHVwcGV0LWNvZGUiCiAgLSAiLS1oaWVyYS1jb25maWciCiAgLSAie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9oaWVyYS55YW1sIgogIC0gIi0tbW9kdWxlLXBhdGgiCiAgLSAie3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzIgogIC0gImFwcGx5Igoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogfC0KICAgIFtkZWZhdWx0XQogICAgcmVnaW9uPXVzLXdlc3QtMQogICJwYXRoIjogIi9yb290Ly5hd3MvY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjAwIgotICJjb250ZW50IjogfAogICAgInB1cHBldF9lbnZpcm9ubWVudCI6ICJwcm9kdWN0aW9uIgogICAgInB1cHBldF9yb2xlIjogImp1bXBob3N0IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9wdXBwZXQueWFtbCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKDQotLU1JTUVCT1VOREFSWS0tDQo="
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jumphost.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "a10311fa96e59a7b199c2b8eb1b041b9-3" -> (known after apply)
      ~ id                     = "3aa738f0-227d-6f06-11a5-c1754428cbdb.zip" -> (known after apply)
      ~ key                    = "3aa738f0-227d-6f06-11a5-c1754428cbdb.zip" # forces replacement -> (known after apply) # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "modules/jumphost/3aa738f0-227d-6f06-11a5-c1754428cbdb.zip" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.jumphost.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "4129585096758259745" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "7cb813c4ee5b40b77eb98c14749f0fdc" -> "715a0f7310ae4dabf9b710802339dcd5"
            # (1 unchanged element hidden)
        }
    }

  # module.jumphost.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "3aa738f0-227d-6f06-11a5-c1754428cbdb" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "requirements.txt" = "7cb813c4ee5b40b77eb98c14749f0fdc" -> "715a0f7310ae4dabf9b710802339dcd5"
            # (1 unchanged element hidden)
        }
      ~ result  = "3aa738f0-227d-6f06-11a5-c1754428cbdb" -> (known after apply)
    }

  # module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["required"] will be created
  + resource "aws_iam_role_policy_attachment" "extra" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "jumphost20230710043044761000000002"
    }

Plan: 5 to add, 4 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.terraform_remote_state.cicd: Reading...%0Amodule.jumphost.null_resource.install_python_dependencies: Refreshing state... [id=4129585096758259745]%0Amodule.release_infrahouse_com["jammy"].random_password.passphrase: Refreshing state... [id=none]%0Amodule.release_infrahouse_com["focal"].random_password.passphrase: Refreshing state... [id=none]%0Amodule.jumphost.random_uuid.lamda_src_hash: Refreshing state... [id=3aa738f0-227d-6f06-11a5-c1754428cbdb]%0Amodule.release_infrahouse_com["jammy"].aws_acm_certificate.repo: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/402852e1-7054-4cea-80ac-3ccbee72a398]%0Amodule.release_infrahouse_com["focal"].aws_acm_certificate.repo: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/2eed53d3-e1ad-4743-ace5-89c193cd3c65]%0Adata.aws_ami.ubuntu_22: Reading...%0Amodule.jumphost.aws_s3_bucket.lambda_tmp: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket.repo: Refreshing state... [id=infrahouse-release-focal]%0Amodule.jumphost.data.aws_region.current: Reading...%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...%0Amodule.jumphost.data.aws_ami.ubuntu: Reading...%0Amodule.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=2218315402]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.jumphost.module.jumphost_userdata.data.aws_region.current: Reading...%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret.key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-jammy-XrTWrP]%0Amodule.jumphost.module.jumphost_userdata.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Reading...%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs]%0Amodule.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_cache_policy.default: Refreshing state... [id=b04aff45-48e1-4501-90d3-998c9fa1f264]%0Adata.aws_ami.ubuntu_22: Read complete after 1s [id=ami-0f324e1cd5c4465c8]%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret.key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-focal-XrTWrP]%0Amodule.jumphost.data.aws_iam_policy_document.assume_role: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs]%0Amodule.jumphost.data.aws_ami.ubuntu: Read complete after 1s [id=ami-0f324e1cd5c4465c8]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_availability_zones.uw1: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy.admin: Reading...%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_cache_policy.default: Refreshing state... [id=5db494dd-546b-4231-a0c7-133b245ada49]%0Adata.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=1585346832]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.admin: Reading...%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG]%0Amodule.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq]%0Adata.terraform_remote_state.cicd: Read complete after 2s%0Amodule.jumphost.data.aws_caller_identity.current: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Aaws_key_pair.aleks: Refreshing state... [id=aleks]%0Amodule.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=83731904]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost20230710043044761000000002]%0Amodule.jumphost.module.jumphost_userdata.data.cloudinit_config.config: Reading...%0Amodule.jumphost.module.jumphost_userdata.data.cloudinit_config.config: Read complete after 0s [id=1671431378]%0Amodule.jumphost.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]%0Amodule.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy.admin: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.admin: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]%0Amodule.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]%0Adata.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::493370826424:policy/ih-tf-infrahouse-website-infra-github]%0Adata.aws_route53_zone.cicd-ih-com: Reading...%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret_version.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG|D6ABCB2B-F850-4487-A764-07263736323E]%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret_version.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq|6586EB13-79C2-424D-AFED-6810E61156D7]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::493370826424:policy/ih-tf-aws-control-493370826424-github]%0Amodule.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost20230710043044760400000001]%0Amodule.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost]%0Amodule.jumphost.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole: Refreshing state... [id=iam_for_lambda-20230710175434878000000001]%0Adata.aws_iam_policy_document.puppet-code-github-assume: Reading...%0Adata.aws_iam_policy_document.puppet-code-github-assume: Read complete after 0s [id=1695170656]%0Adata.aws_iam_policy_document.infrahouse-com-github-assume: Reading...%0Adata.aws_iam_policy_document.infrahouse-com-github-assume: Read complete after 0s [id=1754214164]%0Adata.aws_iam_policy_document.github-assume: Reading...%0Adata.aws_iam_policy_document.github-assume: Read complete after 0s [id=3592205772]%0Amodule.jumphost.aws_s3_object.lambda_package: Refreshing state... [id=3aa738f0-227d-6f06-11a5-c1754428cbdb.zip]%0Amodule.jumphost.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=jumphost20230710043044761000000002-20230810155721624300000001]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=709841391]%0Aaws_iam_role.puppet-code-github: Refreshing state... [id=puppet-code-github]%0Aaws_iam_role.infrahouse-com-github: Refreshing state... [id=infrahouse-com-github]%0Aaws_iam_role.infrahouse-toolkit-github: Refreshing state... [id=infrahouse-toolkit-github]%0Amodule.jumphost.data.aws_route53_zone.jumphost_zone: Reading...%0Amodule.release_infrahouse_com["jammy"].aws_route53_record.cert_validation["release-jammy.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__047ae29925ec0297eaebfeddc886f234.release-jammy.infrahouse.com._CNAME]%0Amodule.release_infrahouse_com["focal"].aws_route53_record.cert_validation["release-focal.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__87f2ead3abf68134c497bf52718e07b1.release-focal.infrahouse.com._CNAME]%0Amodule.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-infrahouse-website-infra-github]%0Amodule.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]%0Amodule.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]%0Amodule.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]%0Amodule.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]%0Amodule.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]%0Amodule.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-01a8ef96822b4b00b]%0Adata.aws_route53_zone.cicd-ih-com: Read complete after 0s [id=Z06790082OU0POPWOCPZ4]%0Amodule.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]%0Amodule.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_ownership_controls.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_ownership_controls.repo: Refreshing state... [id=infrahouse-release-focal]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.public-access: Reading...%0Amodule.jumphost.data.aws_route53_zone.jumphost_zone: Read complete after 1s [id=Z07662251LH3YRF2ERM3G]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.public-access: Read complete after 0s [id=4184171728]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.public-access: Reading...%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.distributions: Refreshing state... [id=conf/distributions]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.public-access: Read complete after 0s [id=1693473946]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.distributions: Refreshing state... [id=conf/distributions]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_public_access_block.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_public_access_block.repo: Refreshing state... [id=infrahouse-release-focal]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_website_configuration.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_website_configuration.repo: Refreshing state... [id=infrahouse-release-focal]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github-20230817010818258200000001]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2899629952]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2714260376]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-infrahouse-website-infra-github-20230818034150993400000001]%0Aaws_route53_record.ci-cd-ns: Refreshing state... [id=Z07662251LH3YRF2ERM3G_ci-cd.infrahouse.com_NS]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_ownership_controls.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_ownership_controls.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs]%0Amodule.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]%0Amodule.jumphost.aws_lambda_function.update_dns: Refreshing state... [id=update_dns]%0Amodule.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]%0Amodule.release_infrahouse_com["jammy"].aws_acm_certificate_validation.repo: Refreshing state... [id=2023-07-24 18:51:39.051 +0000 UTC]%0Amodule.release_infrahouse_com["focal"].aws_acm_certificate_validation.repo: Refreshing state... [id=2023-07-24 18:51:39.442 +0000 UTC]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-infrahouse-website-infra-admin]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_acl.repo: Refreshing state... [id=infrahouse-release-jammy,public-read]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_acl.repo: Refreshing state... [id=infrahouse-release-focal,public-read]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_acl.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs,private]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_acl.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs,private]%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_distribution.repo: Refreshing state... [id=E1IILWIY0OU78B]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-infrahouse-website-infra-admin-20230818034158985100000002]%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_distribution.repo: Refreshing state... [id=E161QGCPE3JIOK]%0Amodule.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20230710045512165400000001]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-release-focal]%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.index-html: Refreshing state... [id=index.html]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.index-html: Refreshing state... [id=index.html]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.deb-gpg-public-key: Refreshing state... [id=DEB-GPG-KEY-release-focal.infrahouse.com]%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.deb-gpg-public-key: Refreshing state... [id=DEB-GPG-KEY-release-jammy.infrahouse.com]%0Amodule.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]%0Amodule.release_infrahouse_com["jammy"].aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_release-jammy.infrahouse.com_A]%0Amodule.release_infrahouse_com["focal"].aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_release-focal.infrahouse.com_A]%0Amodule.jumphost.aws_lambda_function_event_invoke_config.update_dns: Refreshing state... [id=update_dns]%0Amodule.jumphost.aws_cloudwatch_log_group.update_dns: Refreshing state... [id=/aws/lambda/update_dns]%0Amodule.jumphost.aws_cloudwatch_event_rule.scale: Refreshing state... [id=jumphost-scale20230711172747504700000001]%0Amodule.jumphost.aws_autoscaling_lifecycle_hook.launching: Refreshing state... [id=launching]%0Amodule.jumphost.aws_autoscaling_lifecycle_hook.terminating: Refreshing state... [id=terminating]%0Amodule.jumphost.aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_permissions20230711160512724200000001]%0Amodule.jumphost.aws_iam_role_policy_attachment.lambda_permissions: Refreshing state... [id=iam_for_lambda-20230711160513416100000002]%0Adata.aws_iam_policy_document.package-publisher: Reading...%0Adata.aws_iam_policy_document.package-publisher: Read complete after 0s [id=4050006037]%0Aaws_iam_policy.package-publisher: Refreshing state... [id=arn:aws:iam::493370826424:policy/package-publisher]%0Aaws_iam_role_policy_attachment.infrahouse-toolkit-github: Refreshing state... [id=infrahouse-toolkit-github-20230728211642836200000001]%0Aaws_iam_role_policy_attachment.puppet-code-github: Refreshing state... [id=puppet-code-github-20230807171249209900000001]%0Aaws_iam_role_policy_attachment.infrahouse-com-github: Refreshing state... [id=infrahouse-com-github-20230819214139756300000001]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["package-publisher"]: Refreshing state... [id=jumphost20230710043044761000000002-20230724185614710700000003]%0Amodule.jumphost.data.aws_iam_policy_document.lambda_logging: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=1511413075]%0Amodule.jumphost.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_logging20230711160513778300000003]%0Amodule.jumphost.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=iam_for_lambda-20230711160514251100000004]%0Amodule.jumphost.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch-out]%0Amodule.jumphost.aws_cloudwatch_event_target.scale-out: Refreshing state... [id=jumphost-scale20230711172747504700000001-terraform-20230711172747630900000002]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.jumphost.data.archive_file.lambda will be read during apply%0A  # (config refers to values not yet known)%0A <= data "archive_file" "lambda" {%0A      + excludes            = [%0A          + "__pycache__",%0A        ]%0A      + id                  = (known after apply)%0A      + output_base64sha256 = (known after apply)%0A      + output_base64sha512 = (known after apply)%0A      + output_md5          = (known after apply)%0A      + output_path         = (known after apply)%0A      + output_sha          = (known after apply)%0A      + output_sha256       = (known after apply)%0A      + output_sha512       = (known after apply)%0A      + output_size         = (known after apply)%0A      + source_dir          = ".terraform/modules/jumphost/update_dns"%0A      + type                = "zip"%0A    }%0A%0A  # module.jumphost.data.aws_iam_policy_document.lambda-permissions will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_iam_policy_document" "lambda-permissions" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "autoscaling:CompleteLifecycleAction",%0A            ]%0A          + resources = [%0A              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:01326e36-8363-42a8-b06d-f0d8d848a727:autoScalingGroupName/jumphost-20230710045512165400000001",%0A            ]%0A        }%0A      + statement {%0A          + actions   = [%0A              + "ec2:DescribeInstances",%0A              + "ec2:DescribeTags",%0A            ]%0A          + resources = [%0A              + "*",%0A            ]%0A        }%0A      + statement {%0A          + actions   = [%0A              + "ec2:CreateTags",%0A            ]%0A          + resources = [%0A              + "arn:aws:ec2:*:493370826424:instance/*",%0A            ]%0A        }%0A      + statement {%0A          + actions   = [%0A              + "route53:ChangeResourceRecordSets",%0A              + "route53:ListResourceRecordSets",%0A            ]%0A          + resources = [%0A              + "arn:aws:route53:::hostedzone/Z07662251LH3YRF2ERM3G",%0A            ]%0A        }%0A    }%0A%0A  # module.jumphost.data.aws_iam_policy_document.required_permissions will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_iam_policy_document" "required_permissions" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "autoscaling:DescribeAutoScalingInstances",%0A            ]%0A          + resources = [%0A              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:01326e36-8363-42a8-b06d-f0d8d848a727:autoScalingGroupName/jumphost-20230710045512165400000001",%0A            ]%0A        }%0A    }%0A%0A  # module.jumphost.aws_autoscaling_group.jumphost will be updated in-place%0A  ~ resource "aws_autoscaling_group" "jumphost" {%0A        id                               = "jumphost-20230710045512165400000001"%0A        name                             = "jumphost-20230710045512165400000001"%0A        # (27 unchanged attributes hidden)%0A%0A      ~ launch_template {%0A            id      = "lt-01a8ef96822b4b00b"%0A            name    = "jumphost-20230710044926605800000001"%0A          ~ version = "28" -> (known after apply)%0A        }%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.jumphost.aws_iam_policy.lambda_permissions will be updated in-place%0A  ~ resource "aws_iam_policy" "lambda_permissions" {%0A        id          = "arn:aws:iam::493370826424:policy/lambda_permissions20230711160512724200000001"%0A        name        = "lambda_permissions20230711160512724200000001"%0A      ~ policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = "autoscaling:CompleteLifecycleAction"%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:01326e36-8363-42a8-b06d-f0d8d848a727:autoScalingGroupName/jumphost-20230710045512165400000001"%0A                      - Sid      = ""%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "ec2:DescribeTags",%0A                          - "ec2:DescribeInstances",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "*"%0A                      - Sid      = ""%0A                    },%0A                  - {%0A                      - Action   = "ec2:CreateTags"%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:ec2:*:493370826424:instance/*"%0A                      - Sid      = ""%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "route53:ListResourceRecordSets",%0A                          - "route53:ChangeResourceRecordSets",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:route53:::hostedzone/Z07662251LH3YRF2ERM3G"%0A                      - Sid      = ""%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A        tags        = {}%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.jumphost.aws_iam_policy.required will be created%0A  + resource "aws_iam_policy" "required" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + policy      = (known after apply)%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A    }%0A%0A  # module.jumphost.aws_lambda_function.update_dns will be updated in-place%0A  ~ resource "aws_lambda_function" "update_dns" {%0A        id                             = "update_dns"%0A      ~ last_modified                  = "2023-08-02T23:12:52.281+0000" -> (known after apply)%0A      ~ s3_key                         = "3aa738f0-227d-6f06-11a5-c1754428cbdb.zip" -> (known after apply)%0A        tags                           = {}%0A        # (21 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.jumphost.aws_launch_template.jumphost will be updated in-place%0A  ~ resource "aws_launch_template" "jumphost" {%0A        id                      = "lt-01a8ef96822b4b00b"%0A      ~ latest_version          = 28 -> (known after apply)%0A        name                    = "jumphost-20230710044926605800000001"%0A        tags                    = {}%0A      ~ user_data               = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gLSAiaWgtcHVwcGV0IgogIC0gIi0tZGVidWciCiAgLSAiYXBwbHkiCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiB8LQogICAgW2RlZmF1bHRdCiAgICByZWdpb249dXMtd2VzdC0xCiAgInBhdGgiOiAiL3Jvb3QvLmF3cy9jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2MDAiCi0gImNvbnRlbnQiOiB8CiAgICAicHVwcGV0X2Vudmlyb25tZW50IjogInByb2R1Y3Rpb24iCiAgICAicHVwcGV0X3JvbGUiOiAianVtcGhvc3QiCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL3B1cHBldC55YW1sIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgoNCi0tTUlNRUJPVU5EQVJZLS0NCg==" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gLSAiaWgtcHVwcGV0IgogIC0gIi0tZW52aXJvbm1lbnQiCiAgLSAicHJvZHVjdGlvbiIKICAtICItLXJvb3QtZGlyZWN0b3J5IgogIC0gIi9vcHQvcHVwcGV0LWNvZGUiCiAgLSAiLS1oaWVyYS1jb25maWciCiAgLSAie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMve2Vudmlyb25tZW50fS9oaWVyYS55YW1sIgogIC0gIi0tbW9kdWxlLXBhdGgiCiAgLSAie3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzIgogIC0gImFwcGx5Igoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogfC0KICAgIFtkZWZhdWx0XQogICAgcmVnaW9uPXVzLXdlc3QtMQogICJwYXRoIjogIi9yb290Ly5hd3MvY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjAwIgotICJjb250ZW50IjogfAogICAgInB1cHBldF9lbnZpcm9ubWVudCI6ICJwcm9kdWN0aW9uIgogICAgInB1cHBldF9yb2xlIjogImp1bXBob3N0IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9wdXBwZXQueWFtbCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKDQotLU1JTUVCT1VOREFSWS0tDQo="%0A        # (11 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.jumphost.aws_s3_object.lambda_package must be replaced%0A-/+ resource "aws_s3_object" "lambda_package" {%0A      + acl                    = (known after apply)%0A      ~ bucket_key_enabled     = false -> (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      ~ content_type           = "binary/octet-stream" -> (known after apply)%0A      ~ etag                   = "a10311fa96e59a7b199c2b8eb1b041b9-3" -> (known after apply)%0A      ~ id                     = "3aa738f0-227d-6f06-11a5-c1754428cbdb.zip" -> (known after apply)%0A      ~ key                    = "3aa738f0-227d-6f06-11a5-c1754428cbdb.zip" # forces replacement -> (known after apply) # forces replacement%0A      + kms_key_id             = (known after apply)%0A      - metadata               = {} -> null%0A      ~ server_side_encryption = "AES256" -> (known after apply)%0A      ~ source                 = "modules/jumphost/3aa738f0-227d-6f06-11a5-c1754428cbdb.zip" -> (known after apply)%0A      ~ storage_class          = "STANDARD" -> (known after apply)%0A      - tags                   = {} -> null%0A      + version_id             = (known after apply)%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.jumphost.null_resource.install_python_dependencies must be replaced%0A-/+ resource "null_resource" "install_python_dependencies" {%0A      ~ id       = "4129585096758259745" -> (known after apply)%0A      ~ triggers = { # forces replacement%0A          ~ "dependencies_version" = "7cb813c4ee5b40b77eb98c14749f0fdc" -> "715a0f7310ae4dabf9b710802339dcd5"%0A            # (1 unchanged element hidden)%0A        }%0A    }%0A%0A  # module.jumphost.random_uuid.lamda_src_hash must be replaced%0A-/+ resource "random_uuid" "lamda_src_hash" {%0A      ~ id      = "3aa738f0-227d-6f06-11a5-c1754428cbdb" -> (known after apply)%0A      ~ keepers = { # forces replacement%0A          ~ "requirements.txt" = "7cb813c4ee5b40b77eb98c14749f0fdc" -> "715a0f7310ae4dabf9b710802339dcd5"%0A            # (1 unchanged element hidden)%0A        }%0A      ~ result  = "3aa738f0-227d-6f06-11a5-c1754428cbdb" -> (known after apply)%0A    }%0A%0A  # module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["required"] will be created%0A  + resource "aws_iam_role_policy_attachment" "extra" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "jumphost20230710043044761000000002"%0A    }%0A%0APlan: 5 to add, 4 to change, 3 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC8yYTlmY2FlNS1mM2RmLTRkMDktOTdmOC0xOGM0ODFjYmZiMmUvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5kYXRhLnRlcnJhZm9ybV9yZW1vdGVfc3RhdGUuY2ljZDogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0Lm51bGxfcmVzb3VyY2UuaW5zdGFsbF9weXRob25fZGVwZW5kZW5jaWVzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD00MTI5NTg1MDk2NzU4MjU5NzQ1XVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5yYW5kb21fcGFzc3dvcmQucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bm9uZV1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0ucmFuZG9tX3Bhc3N3b3JkLnBhc3NwaHJhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5vbmVdXG5tb2R1bGUuanVtcGhvc3QucmFuZG9tX3V1aWQubGFtZGFfc3JjX2hhc2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTNhYTczOGYwLTIyN2QtNmYwNi0xMWE1LWMxNzU0NDI4Y2JkYl1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX2FjbV9jZXJ0aWZpY2F0ZS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmFjbTp1cy1lYXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlLzQwMjg1MmUxLTcwNTQtNGNlYS04MGFjLTNjY2JlZTcyYTM5OF1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX2FjbV9jZXJ0aWZpY2F0ZS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmFjbTp1cy1lYXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlLzJlZWQ1M2QzLWUxYWQtNDc0My1hY2U1LTg5YzE5M2NkM2M2NV1cbmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5hd3NfczNfYnVja2V0LmxhbWJkYV90bXA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtanVtcGhvc3QtbGFtYmRhLTIwMjMwNzEzMjMzNDU5Njc1ODAwMDAwMDAxXVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbF1cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5qdW1waG9zdF9wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2FtaS51YnVudHU6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXVxubW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODUxMTE5NDI3XVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3RfcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyMTgzMTU0MDJdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXQucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15XVxubW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF91c2VyZGF0YS5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLlxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmtleTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1rZXktamFtbXktWHJUV3JQXVxubW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF91c2VyZGF0YS5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3kuQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlOiBSZWFkaW5nLi4uXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXQucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXktbG9nc11cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M196b25lLmluZnJhaG91c2VfY29tOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19jbG91ZGZyb250X2NhY2hlX3BvbGljeS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1iMDRhZmY0NS00OGUxLTQ1MDEtOTBkMy05OThjOWZhMWYyNjRdXG5kYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hbWktMGYzMjRlMWNkNWM0NDY1YzhdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQua2V5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OnBhY2thZ2VyLWtleS1mb2NhbC1YclRXclBdXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWVfcm9sZTogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI2OTAyNTU0NTVdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXQucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWwtbG9nc11cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19hbWkudWJ1bnR1OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hbWktMGYzMjRlMWNkNWM0NDY1YzhdXG5tb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXVxuZGF0YS5hd3NfYXZhaWxhYmlsaXR5X3pvbmVzLnV3MTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19jbG91ZGZyb250X2NhY2hlX3BvbGljeS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD01ZGI0OTRkZC01NDZiLTQyMzEtYTBjNy0xMzNiMjQ1YWRhNDldXG5kYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdXG5tb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTg1MzQ2ODMyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWphbW15LXhhNlBUR11cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5LkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZTogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvc2VydmljZS1yb2xlL0FXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZV1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5wYXNzcGhyYXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OnBhY2thZ2VyLXBhc3NwaHJhc2UtZm9jYWwtZ3p4UVBxXVxuZGF0YS50ZXJyYWZvcm1fcmVtb3RlX3N0YXRlLmNpY2Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMnNcbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00OTMzNzA4MjY0MjRdXG5hd3Nfa2V5X3BhaXIuYWxla3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFsZWtzXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3ZwYy52cGM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXZwYy0wOGUxOWQ4NTljMjZkMThiMl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTgzNzMxOTA0XVxubW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyXVxubW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF91c2VyZGF0YS5kYXRhLmNsb3VkaW5pdF9jb25maWcuY29uZmlnOiBSZWFkaW5nLi4uXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3VzZXJkYXRhLmRhdGEuY2xvdWRpbml0X2NvbmZpZy5jb25maWc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE2NzE0MzEzNzhdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlLmlhbV9mb3JfbGFtYmRhOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYV1cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQubXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9NWF1cbm1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQuc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fU1BGXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxubW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC50eHRfc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fVFhUXVxubW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC50eHRfZGtpbTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2dvb2dsZS5fZG9tYWlua2V5LmluZnJhaG91c2UuY29tX1RYVF1cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5tb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWdpdGh1Yl1cbmRhdGEuYXdzX3JvdXRlNTNfem9uZS5jaWNkLWloLWNvbTogUmVhZGluZy4uLlxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWphbW15LXhhNlBUR3xENkFCQ0IyQi1GODUwLTQ0ODctQTc2NC0wNzI2MzczNjMyM0VdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5wYXNzcGhyYXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OnBhY2thZ2VyLXBhc3NwaHJhc2UtZm9jYWwtZ3p4UVBxfDY1ODZFQjEzLTc5QzItNDI0RC1BRkVELTY4MTBFNjExNTZEN11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9wb2xpY3kuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtZ2l0aHViXVxubW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcG9saWN5LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2p1bXBob3N0MjAyMzA3MTAwNDMwNDQ3NjA0MDAwMDAwMDFdXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9pbnN0YW5jZV9wcm9maWxlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0XVxubW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlhbV9mb3JfbGFtYmRhLTIwMjMwNzEwMTc1NDM0ODc4MDAwMDAwMDAxXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wdXBwZXQtY29kZS1naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1cHBldC1jb2RlLWdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE2OTUxNzA2NTZdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmluZnJhaG91c2UtY29tLWdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaW5mcmFob3VzZS1jb20tZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTc1NDIxNDE2NF1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNTkyMjA1NzcyXVxubW9kdWxlLmp1bXBob3N0LmF3c19zM19vYmplY3QubGFtYmRhX3BhY2thZ2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTNhYTczOGYwLTIyN2QtNmYwNi0xMWE1LWMxNzU0NDI4Y2JkYi56aXBdXG5tb2R1bGUuanVtcGhvc3QuYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtanVtcGhvc3QtbGFtYmRhLTIwMjMwNzEzMjMzNDU5Njc1ODAwMDAwMDAxXVxubW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyLTIwMjMwODEwMTU1NzIxNjI0MzAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zOTExODQ0ODY4XVxubW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD03MDk4NDEzOTFdXG5hd3NfaWFtX3JvbGUucHVwcGV0LWNvZGUtZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wdXBwZXQtY29kZS1naXRodWJdXG5hd3NfaWFtX3JvbGUuaW5mcmFob3VzZS1jb20tZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWNvbS1naXRodWJdXG5hd3NfaWFtX3JvbGUuaW5mcmFob3VzZS10b29sa2l0LWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0LWdpdGh1Yl1cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yb3V0ZTUzX3pvbmUuanVtcGhvc3Rfem9uZTogUmVhZGluZy4uLlxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wicmVsZWFzZS1qYW1teS5pbmZyYWhvdXNlLmNvbVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX18wNDdhZTI5OTI1ZWMwMjk3ZWFlYmZlZGRjODg2ZjIzNC5yZWxlYXNlLWphbW15LmluZnJhaG91c2UuY29tLl9DTkFNRV1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3JvdXRlNTNfcmVjb3JkLmNlcnRfdmFsaWRhdGlvbltcInJlbGVhc2UtZm9jYWwuaW5mcmFob3VzZS5jb21cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19fODdmMmVhZDNhYmY2ODEzNGM0OTdiZjUyNzE4ZTA3YjEucmVsZWFzZS1mb2NhbC5pbmZyYWhvdXNlLmNvbS5fQ05BTUVdXG5tb2R1bGUubWFuYWdlbWVudC5hd3NfZWlwLm5hdF9laXBbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWlwYWxsb2MtMDJiNDJlNzBkNTJhNWRiN2ZdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1naXRodWJdXG5tb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1naXRodWJdXG5tb2R1bGUubWFuYWdlbWVudC5hd3NfaW50ZXJuZXRfZ2F0ZXdheS5pZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWd3LTA3OTA5MGUwOWVkNWRiNTgyXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX2RlZmF1bHRfcm91dGVfdGFibGUuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBkNzMzODNhZmViNmFkMTQyXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX2RlZmF1bHRfc2VjdXJpdHlfZ3JvdXAuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDhiOTYwYjg1ZjU5OTYxMDBdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wNGExNmU3NGQ1YjEyYTMzOF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTA2N2MzMGU2NWRkNDEwOGU5XVxubW9kdWxlLmp1bXBob3N0LmF3c19sYXVuY2hfdGVtcGxhdGUuanVtcGhvc3Q6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWx0LTAxYThlZjk2ODIyYjRiMDBiXVxuZGF0YS5hd3Nfcm91dGU1M196b25lLmNpY2QtaWgtY29tOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1aMDY3OTAwODJPVTBQT1BXT0NQWjRdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGRmODg1ZGNjOTk0MTg3OTldXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGY5MWRkMjY3NWU3YTE2YzNdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teV1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldF9vd25lcnNoaXBfY29udHJvbHMucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsXVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1YmxpYy1hY2Nlc3M6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yb3V0ZTUzX3pvbmUuanVtcGhvc3Rfem9uZTogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1YmxpYy1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQxODQxNzE3MjhdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHVibGljLWFjY2VzczogUmVhZGluZy4uLlxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfb2JqZWN0LmRpc3RyaWJ1dGlvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvbmYvZGlzdHJpYnV0aW9uc11cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wdWJsaWMtYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNjkzNDczOTQ2XVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfb2JqZWN0LmRpc3RyaWJ1dGlvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvbmYvZGlzdHJpYnV0aW9uc11cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teV1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbF1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF93ZWJzaXRlX2NvbmZpZ3VyYXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15XVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X3dlYnNpdGVfY29uZmlndXJhdGlvbi5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWxdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1naXRodWItMjAyMzA4MTcwMTA4MTgyNTgyMDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODk5NjI5OTUyXVxubW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjcxNDI2MDM3Nl1cbm1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWdpdGh1Yi0yMDIzMDgxODAzNDE1MDk5MzQwMDAwMDAwMV1cbmF3c19yb3V0ZTUzX3JlY29yZC5jaS1jZC1uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2NpLWNkLmluZnJhaG91c2UuY29tX05TXVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5yZXBvLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teS1sb2dzXVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5yZXBvLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbC1sb2dzXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLmRlZmF1bHRfbWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGQ3MzM4M2FmZWI2YWQxNDIxMDgwMjg5NDk0XVxubW9kdWxlLmp1bXBob3N0LmF3c19sYW1iZGFfZnVuY3Rpb24udXBkYXRlX2RuczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXBkYXRlX2Ruc11cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHVibGljW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA0YTE2ZTc0ZDViMTJhMzM4MTA4MDI4OTQ5NF1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTIwMjMtMDctMjQgMTg6NTE6MzkuMDUxICswMDAwIFVUQ11cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTIwMjMtMDctMjQgMTg6NTE6MzkuNDQyICswMDAwIFVUQ11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW5dXG5tb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluXVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X2FjbC5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXkscHVibGljLXJlYWRdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXRfYWNsLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbCxwdWJsaWMtcmVhZF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTA4YTQxMDE2MGUyZGNjNTkyXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMDk5Yjk1OGFmMTk0ODVmMmJdXG5tb2R1bGUubWFuYWdlbWVudC5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wOGZiOWI1MjY4MzI3Nzk0N11cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF9hY2wucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXktbG9ncyxwcml2YXRlXVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X2FjbC5yZXBvLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbC1sb2dzLHByaXZhdGVdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19jbG91ZGZyb250X2Rpc3RyaWJ1dGlvbi5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1FMUlJTFdJWTBPVTc4Ql1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4tMjAyMzA3MDkxNjQzMjEzMTk5MDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLTIwMjMwODE4MDM0MTU4OTg1MTAwMDAwMDAyXVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfY2xvdWRmcm9udF9kaXN0cmlidXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9RTE2MVFHQ1BFM0pJT0tdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC0yMDIzMDcxMDA0NTUxMjE2NTQwMDAwMDAwMV1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF9wb2xpY3kucHVibGljLWFjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15XVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X3BvbGljeS5wdWJsaWMtYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWxdXG5tb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19vYmplY3QuaW5kZXgtaHRtbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5kZXguaHRtbF1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX29iamVjdC5pbmRleC1odG1sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmRleC5odG1sXVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfb2JqZWN0LmRlYi1ncGctcHVibGljLWtleTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9REVCLUdQRy1LRVktcmVsZWFzZS1mb2NhbC5pbmZyYWhvdXNlLmNvbV1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX29iamVjdC5kZWItZ3BnLXB1YmxpYy1rZXk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPURFQi1HUEctS0VZLXJlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb21dXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3ByaXZhdGVbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTkxMDgwMjg5NDk0XVxubW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3Nfcm91dGU1M19yZWNvcmQucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb21fQV1cbm1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3JvdXRlNTNfcmVjb3JkLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19yZWxlYXNlLWZvY2FsLmluZnJhaG91c2UuY29tX0FdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9mdW5jdGlvbl9ldmVudF9pbnZva2VfY29uZmlnLnVwZGF0ZV9kbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXVwZGF0ZV9kbnNdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2Nsb3Vkd2F0Y2hfbG9nX2dyb3VwLnVwZGF0ZV9kbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPS9hd3MvbGFtYmRhL3VwZGF0ZV9kbnNdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfcnVsZS5zY2FsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3Qtc2NhbGUyMDIzMDcxMTE3Mjc0NzUwNDcwMDAwMDAwMV1cbm1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfbGlmZWN5Y2xlX2hvb2subGF1bmNoaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sYXVuY2hpbmddXG5tb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2xpZmVjeWNsZV9ob29rLnRlcm1pbmF0aW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJtaW5hdGluZ11cbm1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3BvbGljeS5sYW1iZGFfcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2xhbWJkYV9wZXJtaXNzaW9uczIwMjMwNzExMTYwNTEyNzI0MjAwMDAwMDAxXVxubW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5sYW1iZGFfcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlhbV9mb3JfbGFtYmRhLTIwMjMwNzExMTYwNTEzNDE2MTAwMDAwMDAyXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wYWNrYWdlLXB1Ymxpc2hlcjogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wYWNrYWdlLXB1Ymxpc2hlcjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDA1MDAwNjAzN11cbmF3c19pYW1fcG9saWN5LnBhY2thZ2UtcHVibGlzaGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9wYWNrYWdlLXB1Ymxpc2hlcl1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViLTIwMjMwNzI4MjExNjQyODM2MjAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnB1cHBldC1jb2RlLWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHVwcGV0LWNvZGUtZ2l0aHViLTIwMjMwODA3MTcxMjQ5MjA5OTAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmluZnJhaG91c2UtY29tLWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb20tZ2l0aHViLTIwMjMwODE5MjE0MTM5NzU2MzAwMDAwMDAxXVxubW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5leHRyYVtcInBhY2thZ2UtcHVibGlzaGVyXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyLTIwMjMwNzI0MTg1NjE0NzEwNzAwMDAwMDAzXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhX2xvZ2dpbmc6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYV9sb2dnaW5nOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTExNDEzMDc1XVxubW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcG9saWN5LmxhbWJkYV9sb2dnaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9sYW1iZGFfbG9nZ2luZzIwMjMwNzExMTYwNTEzNzc4MzAwMDAwMDAzXVxubW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5sYW1iZGFfbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTExNjA1MTQyNTExMDAwMDAwMDRdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9wZXJtaXNzaW9uLmFsbG93X2Nsb3Vkd2F0Y2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUFsbG93RXhlY3V0aW9uRnJvbUNsb3VkV2F0Y2gtb3V0XVxubW9kdWxlLmp1bXBob3N0LmF3c19jbG91ZHdhdGNoX2V2ZW50X3RhcmdldC5zY2FsZS1vdXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LXNjYWxlMjAyMzA3MTExNzI3NDc1MDQ3MDAwMDAwMDEtdGVycmFmb3JtLTIwMjMwNzExMTcyNzQ3NjMwOTAwMDAwMDAyXVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG4gIH4gdXBkYXRlIGluLXBsYWNlXG4tLysgZGVzdHJveSBhbmQgdGhlbiBjcmVhdGUgcmVwbGFjZW1lbnRcbiA8PSByZWFkIChkYXRhIHJlc291cmNlcylcblxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QuZGF0YS5hcmNoaXZlX2ZpbGUubGFtYmRhIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHlcbiAgIyAoY29uZmlnIHJlZmVycyB0byB2YWx1ZXMgbm90IHlldCBrbm93bilcbiA8PSBkYXRhIFwiYXJjaGl2ZV9maWxlXCIgXCJsYW1iZGFcIiB7XG4gICAgICArIGV4Y2x1ZGVzICAgICAgICAgICAgPSBbXG4gICAgICAgICAgKyBcIl9fcHljYWNoZV9fXCIsXG4gICAgICAgIF1cbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X2Jhc2U2NHNoYTI1NiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X2Jhc2U2NHNoYTUxMiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X21kNSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3BhdGggICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NoYSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NoYTI1NiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NoYTUxMiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NpemUgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc291cmNlX2RpciAgICAgICAgICA9IFwiLnRlcnJhZm9ybS9tb2R1bGVzL2p1bXBob3N0L3VwZGF0ZV9kbnNcIlxuICAgICAgKyB0eXBlICAgICAgICAgICAgICAgID0gXCJ6aXBcIlxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYS1wZXJtaXNzaW9ucyB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZylcbiA8PSBkYXRhIFwiYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnRcIiBcImxhbWJkYS1wZXJtaXNzaW9uc1wiIHtcbiAgICAgICsgaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsganNvbiA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBzdGF0ZW1lbnQge1xuICAgICAgICAgICsgYWN0aW9ucyAgID0gW1xuICAgICAgICAgICAgICArIFwiYXV0b3NjYWxpbmc6Q29tcGxldGVMaWZlY3ljbGVBY3Rpb25cIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgICArIHJlc291cmNlcyA9IFtcbiAgICAgICAgICAgICAgKyBcImFybjphd3M6YXV0b3NjYWxpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDphdXRvU2NhbGluZ0dyb3VwOjAxMzI2ZTM2LTgzNjMtNDJhOC1iMDZkLWYwZDhkODQ4YTcyNzphdXRvU2NhbGluZ0dyb3VwTmFtZS9qdW1waG9zdC0yMDIzMDcxMDA0NTUxMjE2NTQwMDAwMDAwMVwiLFxuICAgICAgICAgICAgXVxuICAgICAgICB9XG4gICAgICArIHN0YXRlbWVudCB7XG4gICAgICAgICAgKyBhY3Rpb25zICAgPSBbXG4gICAgICAgICAgICAgICsgXCJlYzI6RGVzY3JpYmVJbnN0YW5jZXNcIixcbiAgICAgICAgICAgICAgKyBcImVjMjpEZXNjcmliZVRhZ3NcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgICArIHJlc291cmNlcyA9IFtcbiAgICAgICAgICAgICAgKyBcIipcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgfVxuICAgICAgKyBzdGF0ZW1lbnQge1xuICAgICAgICAgICsgYWN0aW9ucyAgID0gW1xuICAgICAgICAgICAgICArIFwiZWMyOkNyZWF0ZVRhZ3NcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgICArIHJlc291cmNlcyA9IFtcbiAgICAgICAgICAgICAgKyBcImFybjphd3M6ZWMyOio6NDkzMzcwODI2NDI0Omluc3RhbmNlLypcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgfVxuICAgICAgKyBzdGF0ZW1lbnQge1xuICAgICAgICAgICsgYWN0aW9ucyAgID0gW1xuICAgICAgICAgICAgICArIFwicm91dGU1MzpDaGFuZ2VSZXNvdXJjZVJlY29yZFNldHNcIixcbiAgICAgICAgICAgICAgKyBcInJvdXRlNTM6TGlzdFJlc291cmNlUmVjb3JkU2V0c1wiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgcmVzb3VyY2VzID0gW1xuICAgICAgICAgICAgICArIFwiYXJuOmF3czpyb3V0ZTUzOjo6aG9zdGVkem9uZS9aMDc2NjIyNTFMSDNZUkYyRVJNM0dcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJlcXVpcmVkX3Blcm1pc3Npb25zIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHlcbiAgIyAoZGVwZW5kcyBvbiBhIHJlc291cmNlIG9yIGEgbW9kdWxlIHdpdGggY2hhbmdlcyBwZW5kaW5nKVxuIDw9IGRhdGEgXCJhd3NfaWFtX3BvbGljeV9kb2N1bWVudFwiIFwicmVxdWlyZWRfcGVybWlzc2lvbnNcIiB7XG4gICAgICArIGlkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGpzb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgc3RhdGVtZW50IHtcbiAgICAgICAgICArIGFjdGlvbnMgICA9IFtcbiAgICAgICAgICAgICAgKyBcImF1dG9zY2FsaW5nOkRlc2NyaWJlQXV0b1NjYWxpbmdJbnN0YW5jZXNcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgICArIHJlc291cmNlcyA9IFtcbiAgICAgICAgICAgICAgKyBcImFybjphd3M6YXV0b3NjYWxpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDphdXRvU2NhbGluZ0dyb3VwOjAxMzI2ZTM2LTgzNjMtNDJhOC1iMDZkLWYwZDhkODQ4YTcyNzphdXRvU2NhbGluZ0dyb3VwTmFtZS9qdW1waG9zdC0yMDIzMDcxMDA0NTUxMjE2NTQwMDAwMDAwMVwiLFxuICAgICAgICAgICAgXVxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19ncm91cC5qdW1waG9zdCB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcbiAgfiByZXNvdXJjZSBcImF3c19hdXRvc2NhbGluZ19ncm91cFwiIFwianVtcGhvc3RcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJqdW1waG9zdC0yMDIzMDcxMDA0NTUxMjE2NTQwMDAwMDAwMVwiXG4gICAgICAgIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJqdW1waG9zdC0yMDIzMDcxMDA0NTUxMjE2NTQwMDAwMDAwMVwiXG4gICAgICAgICMgKDI3IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgfiBsYXVuY2hfdGVtcGxhdGUge1xuICAgICAgICAgICAgaWQgICAgICA9IFwibHQtMDFhOGVmOTY4MjJiNGIwMGJcIlxuICAgICAgICAgICAgbmFtZSAgICA9IFwianVtcGhvc3QtMjAyMzA3MTAwNDQ5MjY2MDU4MDAwMDAwMDFcIlxuICAgICAgICAgIH4gdmVyc2lvbiA9IFwiMjhcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgIH1cblxuICAgICAgICAjICgyIHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3BvbGljeS5sYW1iZGFfcGVybWlzc2lvbnMgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwibGFtYmRhX3Blcm1pc3Npb25zXCIge1xuICAgICAgICBpZCAgICAgICAgICA9IFwiYXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvbGFtYmRhX3Blcm1pc3Npb25zMjAyMzA3MTExNjA1MTI3MjQyMDAwMDAwMDFcIlxuICAgICAgICBuYW1lICAgICAgICA9IFwibGFtYmRhX3Blcm1pc3Npb25zMjAyMzA3MTExNjA1MTI3MjQyMDAwMDAwMDFcIlxuICAgICAgfiBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgIC0gU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgLSB7XG4gICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFwiYXV0b3NjYWxpbmc6Q29tcGxldGVMaWZlY3ljbGVBY3Rpb25cIlxuICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOmF1dG9zY2FsaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6YXV0b1NjYWxpbmdHcm91cDowMTMyNmUzNi04MzYzLTQyYTgtYjA2ZC1mMGQ4ZDg0OGE3Mjc6YXV0b1NjYWxpbmdHcm91cE5hbWUvanVtcGhvc3QtMjAyMzA3MTAwNDU1MTIxNjU0MDAwMDAwMDFcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZWMyOkRlc2NyaWJlVGFnc1wiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZWMyOkRlc2NyaWJlSW5zdGFuY2VzXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gUmVzb3VyY2UgPSBcIipcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gXCJlYzI6Q3JlYXRlVGFnc1wiXG4gICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gUmVzb3VyY2UgPSBcImFybjphd3M6ZWMyOio6NDkzMzcwODI2NDI0Omluc3RhbmNlLypcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICAtIHtcbiAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwicm91dGU1MzpMaXN0UmVzb3VyY2VSZWNvcmRTZXRzXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJyb3V0ZTUzOkNoYW5nZVJlc291cmNlUmVjb3JkU2V0c1wiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOnJvdXRlNTM6Ojpob3N0ZWR6b25lL1owNzY2MjI1MUxIM1lSRjJFUk0zR1wiXG4gICAgICAgICAgICAgICAgICAgICAgLSBTaWQgICAgICA9IFwiXCJcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgIC0gVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCJcbiAgICAgICAgICAgIH1cbiAgICAgICAgKSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgIHRhZ3MgICAgICAgID0ge31cbiAgICAgICAgIyAoNiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcG9saWN5LnJlcXVpcmVkIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInJlcXVpcmVkXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIlxuICAgICAgKyBwb2xpY3kgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0LmF3c19sYW1iZGFfZnVuY3Rpb24udXBkYXRlX2RucyB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcbiAgfiByZXNvdXJjZSBcImF3c19sYW1iZGFfZnVuY3Rpb25cIiBcInVwZGF0ZV9kbnNcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidXBkYXRlX2Ruc1wiXG4gICAgICB+IGxhc3RfbW9kaWZpZWQgICAgICAgICAgICAgICAgICA9IFwiMjAyMy0wOC0wMlQyMzoxMjo1Mi4yODErMDAwMFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gczNfa2V5ICAgICAgICAgICAgICAgICAgICAgICAgID0gXCIzYWE3MzhmMC0yMjdkLTZmMDYtMTFhNS1jMTc1NDQyOGNiZGIuemlwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7fVxuICAgICAgICAjICgyMSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG5cbiAgICAgICAgIyAoMyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX2xhdW5jaF90ZW1wbGF0ZS5qdW1waG9zdCB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcbiAgfiByZXNvdXJjZSBcImF3c19sYXVuY2hfdGVtcGxhdGVcIiBcImp1bXBob3N0XCIge1xuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICA9IFwibHQtMDFhOGVmOTY4MjJiNGIwMGJcIlxuICAgICAgfiBsYXRlc3RfdmVyc2lvbiAgICAgICAgICA9IDI4IC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgICAgPSBcImp1bXBob3N0LTIwMjMwNzEwMDQ0OTI2NjA1ODAwMDAwMDAxXCJcbiAgICAgICAgdGFncyAgICAgICAgICAgICAgICAgICAgPSB7fVxuICAgICAgfiB1c2VyX2RhdGEgICAgICAgICAgICAgICA9IFwiUTI5dWRHVnVkQzFVZVhCbE9pQnRkV3gwYVhCaGNuUXZiV2w0WldRN0lHSnZkVzVrWVhKNVBTSk5TVTFGUWs5VlRrUkJVbGtpQ2sxSlRVVXRWbVZ5YzJsdmJqb2dNUzR3RFFvTkNpMHRUVWxOUlVKUFZVNUVRVkpaRFFwRGIyNTBaVzUwTFZSeVlXNXpabVZ5TFVWdVkyOWthVzVuT2lBM1ltbDBEUXBEYjI1MFpXNTBMVlI1Y0dVNklIUmxlSFF2WTJ4dmRXUXRZMjl1Wm1sbkRRcE5hVzFsTFZabGNuTnBiMjQ2SURFdU1BMEtEUW9qWTJ4dmRXUXRZMjl1Wm1sbkNpSmhjSFFpT2dvZ0lDSnpiM1Z5WTJWeklqb0tJQ0FnSUNKcGJtWnlZV2h2ZFhObElqb0tJQ0FnSUNBZ0ltdGxlU0k2SUh3S0lDQWdJQ0FnSUNBdExTMHRMVUpGUjBsT0lGQkhVQ0JRVlVKTVNVTWdTMFZaSUVKTVQwTkxMUzB0TFMwS0NpQWdJQ0FnSUNBZ2JWRkpUa0pIVXpkR2RHdENSVUZFUml0WmJVUm5ObEYyYzNZMVZqWmFVWGNyVVdoNFpGUjJhazFZWlV4RE9WUTJVa1pTVmtRNU5EZHhTM3AwVGs1UmJnb2dJQ0FnSUNBZ0lDdEJMM2w0Y0hKTVFXMVhNalZWZFM4eE1XOURjM3BPVmtsSllWSXpUMWs0VFhSNWFXeGlRM1I2Vld0Q2VuWlhaR3hZTTBoMlZIYzVNVXh3T0dKNFZVd0tJQ0FnSUNBZ0lDQkZXRTlOT1c1elkzRlBjazkyWmtKcVlXNXdiRXRFUlV0UVRWazJka2xhTTJ0d01YSlZjME5PUjB4Q1REQjRNa3RhWjFVNE1IVnNVbk5OVFRoeGJrSk9DaUFnSUNBZ0lDQWdhM0JVYVVGbFdFdFBSVlowVW5wc1YyeDJUMFpNU2pkd1dVUjJZVm93VldkSVUxWjFSU3RhYTJ4a2NVOWtURXhTY0V0clpFbDJTbEJqYTFoeFREVjRWQW9nSUNBZ0lDQWdJRlYyVjFSWE1XVnVSa0ZJWkRVclRsRjRUVzVEWVROcGEycFJWak5FVkd4RmFuTm5URXhSWW1KNWMxaHFXRkJ5TmxCSlVITXlPV05VWTJadmNUUXpNVThLSUNBZ0lDQWdJQ0IwVWpSRWNscENOSFpOUlU5Qk9EaFViVXRDYTBWcFRVY3JhVUk1WTJwNk5YZENTWFZOZFRrMVdtMXZTbmhrZG1wUVVqY3lSbGxMWjNKRFdFNTBUbWhrQ2lBZ0lDQWdJQ0FnVm1WeVJWSjJjRXhVYUdSaFVtMWFaMmszYkhrclJIWnJXVGRNY1hsS1VIWmtTR054ZUdWa1owWnVVRXRTTkZRcloxTlJiV0pWVUdRNWNYRmtTbEl3VVFvZ0lDQWdJQ0FnSUV0c0wxQnRkSFZUTDNjNVoza3lXalJoZVRCUlNVdHlUa0o2VVhob1FUaE1SRnB3Y0RGeWRXWkRTalVyV2sxbFpqa3dka2h3ZDNoTkswOWhVSEo1VG13S0lDQWdJQ0FnSUNCRlpFUlhOMWxST0daMVFqVnVVSEZxZDFWQmNHMXNXVmxNU2xsc1pEZDJTamM1UlVsNEwzTnFaMmcyUnl0SlJtbHROM2hTTjFkcFVVWXZia3BsZG1aeENpQWdJQ0FnSUNBZ2RucFpUemR2Y2k5SFNVTmlObVZhZDNaUVpIUjVOemxJYlZabFVIRkZWR3hFVlRBd2IzbHZjRmQ1VkhOWmVWTlpSRk5JYmk4MFpHOVVkWGc0ZGl0R0x3b2dJQ0FnSUNBZ0lGbGxlV0oyWjNGaWNtbElOMmxUUmpoSWVIZEZSbVZFYW5KTmRGVlVTSE5ZUXpNMVJFaEdaVTFEYUVwdmVITjVTM1kwT0VvcllrbEhSbmRCVWtGUlFVSUtJQ0FnSUNBZ0lDQjBRekZLWW0xYWVWbFZhSFprV0U1c1NVWkNhRmt5ZEdoYU1sWjVTVVI0ZDFsWFRuSlpWMlJzWTJ0Q2NHSnRXbmxaVjJoMlpGaE9iRXh0VG5aaVZEWktDaUFnSUNBZ0lDQWdRV3hSUlVWM1JVdEJSRFJYU1ZGVGFVNW9OV3RaTTNjNFZ6Qm5RVVk0V0dkMVNtRnZlR1pqUkRkM1ZVTmFUSE5YTWxGSllrRjNWVXBCT0VwdVFVRlZUQW9nSUNBZ0lDQWdJRU5SWjBoQloxbFdRMmRyU1VOM1NVVkdaMGxFUVZGSlpVRlJTVmhuUVVGTFExSkVaM1ZLWVc5NFptTkVOM2RpTjBRdk9XVnVZblJQTVVSRlVXNHhVSFFLSUNBZ0lDQWdJQ0JvWjJ0MFNDdEpjbUpDWkZsU1NHczNNV2xzTW1oaWJtMUJZbTlNYTJzeFlXc3ZZV0ZSV1M5WVVVUktSbWh5UVRkcVRXdFFURTlEVW1WdmRFaHBVVzEyQ2lBZ0lDQWdJQ0FnTVZWbWNVUmpUVEpsVVRRdmVEQk9PVVl5UkV4VlUydDFkM2N4TVRkMmRIUlZiMEo0YVhKQ056SndUekJVTDJ4a09XOHpPVk5JVFVNdlJHWnJObmsyYUFvZ0lDQWdJQ0FnSUhSVVIzRjRUR2RvT0dvelJGTjVUelZGUlhKS1RHRXZNMEoyVFhGeU5HbHhZak5RVkhkT1pVUlNSV3BoZGxGS2FGaFRka1ZHYW5sQlEyOXZPV1EzY25NS0lDQWdJQ0FnSUNBM2JHaERZbUpUVUdwblZHTkhMMUJEWm5wTWNqTTNVWGw2V0dsVVVpOVVkMnBwZDFaa1ZHaGtRMU12UTB0dWMyOU5PRzVuU0hocVdGbHdTemROTm5kbkNpQWdJQ0FnSUNBZ2RIcEJPRXByU0ZweU5VMXdhM0pRUjNKblVXVjJhRXBDVEd0SVVpOXFZM05oWVVKYVRqZHVkemhoWlVoamQzZE5OQzlEYUVoSmVWcGtVVGt4TURVNWNBb2dJQ0FnSUNBZ0lFOU5ZVmx0VjIxcVVGRm1jVEZ5VDI1QlFYWkJNWGhYZHl0VVdrNTZTR2RYU1hFMGRuVnplRGRQUW5aeVJuTldaVnBPYzNGa04wOWhOSEJ5ZEZaWFp6QUtJQ0FnSUNBZ0lDQTVNV05MV2twdkwwOTJObTl3VFM5M1JGZE9NbmxDYm10dFFrTjNZVmh3YjBnMVRrUlJNakppYUc1SFZFcGxTVmRrWldrNFZWTkhjSFpDYTFSNFFra3lDaUFnSUNBZ0lDQWdXRE15Y0hsUGJWcEViamd4VERKNlRUSnBiMDUyWjFoSllqVjFOWFJxWWpsT1QybEJkRFp2VnpCSE1IZ3dNR1JuY2pOeU5uQjFPSEZ0VFhkclFsWkNRd29nSUNBZ0lDQWdJSFpYZDBWdFlYaFJibXRVYUc1aVFXUTFOMVppWVhRMEx5OTFSR05JUm5CRVlVSlFjRVpYWlVOTU1tUm1SRk55VXpscGFVczJTekZXYTNaSFRHOVlhRGdLSUNBZ0lDQWdJQ0JOY0VweGFtOWtaSEJtVG1nMGRYbG1la3Q1VGtVeFpISlJNamx0WTNkbVNXeDZXRzlRY21Jd09WYzJXa2h3YlN0MGNXUTRUV3MzTURkNmQzTmtSa2RTQ2lBZ0lDQWdJQ0FnY1ZKemVHMTBVRzQ1U2pGeVpWbGFhVloxUlRWSE1qWm1NV0ZMVkZJM2EwTkVVVkpyZFhoaVdrRlNRVUUwS3pscmJqUnpiVUpZV21OTk1IWkdjVGxTT0FvZ0lDQWdJQ0FnSURJMFdFdGFkRlJoVm0xV2IxWktUVkpSVFRRMGNWZFNLM012VXpCTmVuWmlUelYxTUdOVFZsUm9XVFkxV1hwTlRITTVNakJWV1RaMVIzQnZVekphV1hjS0lDQWdJQ0FnSUNCSlRXbHdhMkZDS3pKR05rSTRVamRXTjI1c0wxTm5ZVmhIWVRKTlpYaHJRemQzZERaaWJFWmlZWGMzY0dKMlNTdHBTVGwzVXpoQ1MwaG5UVVI2WkRCR0NpQWdJQ0FnSUNBZ1ZHcFRjVGwyWkd0V2EyWTNlVWt6YUVWM2JHeFlOM3BVTmtsTVQzWnJiazVIWW05ek1HUkdTVGt5WTBKWFVYTXJhVmhRTlRCNFJGWnBkRE1yT1cxRFJBb2dJQ0FnSUNBZ0lISjFWMVpaYXpjemJYWlRSWHBHWTNWWVEzbGlTMG8xVlM5dWVsTlJOekJLYjFGdFUxQmpOVEJTVVdwMVNFZGtlbXd2V1hwSFJtRkdialY2U1ZvMWNGQUtJQ0FnSUNBZ0lDQnJOVk1yUzFSWlpXdDZZMmxTYTBoNlltVmhOVkJxSzBFMlMxcHBiRXRxTlhsclFWSkdlbmNyUTFCNGNYTjFaV3BFYTJrM1FTdGhNMjB6VjBkeEsyMXRDaUFnSUNBZ0lDQWdRV3RzVVRSWlFtTnZiSHBPVDNCblYyTnNTVk4xUlROa05XdG5kR0ZLUVVOSlozUmxPRGRHTmxGQ1FuTnJPRzlFUWtaUlEyNWFiVzlQYVhKc1UyeGlaZ29nSUNBZ0lDQWdJRXAxUkRabVZrTktkVEo2V1RkVWFFNHhUekJ2VjFSM1FXRk9RWFpOTlRWRFRGUjJObk16Um0xMFVqa3liRzVzVVVSR2RVb3JabW80TmpOak5uRjRNVFFLSUNBZ0lDQWdJQ0JHZFU4MGJVMDNaWFZUTURoM1IyZFdSMjA1TVhkQk4ySlpiRFJoYUhoRE5sTXlRa2RDTlVaMmExcG1la0pDZDJwelptMVZWMGhCZFRkV1VscEtlR3RZQ2lBZ0lDQWdJQ0FnU25BMk9UWlBWR1JTTTFKbVNUZEpXalpQVnpaMFIwVk1hV3B6ZDFkaVlscFlZalZZVWxkRlZ6azVkbGRQTjA1SlN6WnpUM1pvVFVST2NEbGlVMDExWWdvZ0lDQWdJQ0FnSUZoUU0xQmlVSGhuZVZRd1ltMXpjekI1ZDA1WmQzVmpibVpqYlVSWWNWQldkVE5IWkhRMU0yRjBNU3RvU3pkdGJHNVJNM1ZWY3pWbFZrVlBTVWh1U20wS0lDQWdJQ0FnSUNCbU1YUnlSR2RuVTFSRk4yWnVhM2cyUTNwc0sybE5hMEZGVVVWQlFWbHJRMUJCVVZsQlVXOUJTbWhaYUVKTFNUSkliVkpxWmtSNFlsTkJRVmg0WlVNMENpQWdJQ0FnSUNBZ2JIRnFSamwzVUhaQ1VVcHJkWGhpV2tGb2MwMUNVV3RFZDIxalFVRkJiMHBGVDBNMGJIRnFSamwzVUhZNFUxRlFMMnB6VVdaS1ExVkljbXB3V0RSbVVBb2dJQ0FnSUNBZ0lEQk9kRlo1Y1d4RGNuRXhUMjFNVURkQ1RISllja040YjBGR1VtSTJORmxLVldSWGF6VlFNelZyT1hkcU1rSlJhbkJxWTA1cU1tbHJPREJHYjI4d01rVUtJQ0FnSUNBZ0lDQjVZeXRRZWxjdk5IUjZWblprZUZKeVJYcHpUMFp0SzIxTlVpdHNiRlZJUVV0NlFtRTJVVUo0U0ZRd2IyWk1OM0ExV0ZsVWRVMU9ibGx2SzFCcVZrMXRDaUFnSUNBZ0lDQWdhbEF6VkVWS1IxbFlXVzExYUVkbVlXRktXbkJxVEcxS1JuRndOVGw0THk5a2MwMUlaVXh4VlVOb2QySTJRMmMyUkhWclFXbG9aVUZ6TTFBcmNsaHZNd29nSUNBZ0lDQWdJSFJDYmtFMFNrTkRhVmhTTnk4dk1GZGxlbEp2VTFCa1lXeE9aVzAwZG5NNFVGUTROM051U0dKRWJHbEdUVlptT0hjclptdHpTVzV4ZG05MGFWSkVTVFFLSUNBZ0lDQWdJQ0JSUW5KQ1puTXpUbVJsV2xjdmRHMTFjRTloV2twU2VraEVkblpMWW1jdkwwODJhWEF4WVZCMlNVeFhkbFJFVFRoTFkxRkRVVVZUWVZkclEySkpNWFZqQ2lBZ0lDQWdJQ0FnY21sNlFVMWliRlJDTW1kNWR6bDViMnBEY0ZaRFRVSllaR2w2UVhGeGVXdzFXbFp5ZHpRcldDOXBNRGxKYzA1ME9HaEJPUzgxVWxrM2RqTmpOMW95UXdvZ0lDQWdJQ0FnSUZoNU1uaExWMjEwVEVrNWJteFBVMU4zVlhoQ05UWTJTVEk1YkZaTFFreFZiVmh0VVdadVVrbEpTRU5wU2tSWVdVWkVVQzgyVEdaMk9TdHRhRVZYVlRnS0lDQWdJQ0FnSUNCeFpXUXplR2h3WlU1VFFVbDZRU3ROVkd4cWRHbFNiVzl5ZUhCa1pHbFlZblJEWVdaalVHd3ZTak5ZTUVJd04yWmpZMHBhZDFwelExbERjSFJNZVRGakNpQWdJQ0FnSUNBZ2VYWldZVTRyUlVKdGFtOURjRE5xZERaM1RHVTBlR05zY1ZVelFVTjNlaTg0VkVSRWJYUktOMVZWWkd3M1RXUnJhWEJSV2pJM09Fd3lhM0JzTm04Mk1Rb2dJQ0FnSUNBZ0lFMUdNbVpZUkRkbVdrMWxXbVpGZHpac2RUQkNSalZ0V2pBdlkyZ3pTSGhZWlZwdldHbG1OemxuTWpWMldtMVRaRmM1TjNCalpXVjNVR3gyYkVWVVJsRUtJQ0FnSUNBZ0lDQTFOWEJOYjNKUmVWVlVSVkZEVVRORlEzcElXVk51VEM5VWJWYzNDaUFnSUNBZ0lDQWdQU3N3VW1NS0lDQWdJQ0FnSUNBdExTMHRMVVZPUkNCUVIxQWdVRlZDVEVsRElFdEZXU0JDVEU5RFN5MHRMUzB0Q2lBZ0lDQWdJQ0p6YjNWeVkyVWlPaUFpWkdWaUlGdHphV2R1WldRdFluazlKRXRGV1Y5R1NVeEZYU0JvZEhSd2N6b3ZMM0psYkdWaGMyVXRhbUZ0YlhrdWFXNW1jbUZvYjNWelpTNWpiMjB2SUNSU1JVeEZRVk5GQ2lBZ0lDQWdJQ0FnYldGcGJpSUtJbkJoWTJ0aFoyVmZkWEJrWVhSbElqb2dkSEoxWlFvaWNHRmphMkZuWlhNaU9nb3RJQ0p3ZFhCd1pYUXRZMjlrWlNJS0xTQWlhVzVtY21Gb2IzVnpaUzEwYjI5c2EybDBJZ29pY0hWd2NHVjBJam9LSUNBaVkyOXNiR1ZqZEdsdmJpSTZJQ0p3ZFhCd1pYUTRJZ29nSUNKcGJuTjBZV3hzSWpvZ2RISjFaUW9nSUNKcGJuTjBZV3hzWDNSNWNHVWlPaUFpWVdsdklnb2dJQ0p3WVdOcllXZGxYMjVoYldVaU9pQWljSFZ3Y0dWMExXRm5aVzUwSWdvZ0lDSnpkR0Z5ZEY5elpYSjJhV05sSWpvZ1ptRnNjMlVLSW5KMWJtTnRaQ0k2Q2kwZ0xTQWlhV2d0Y0hWd2NHVjBJZ29nSUMwZ0lpMHRaR1ZpZFdjaUNpQWdMU0FpWVhCd2JIa2lDaUozY21sMFpWOW1hV3hsY3lJNkNpMGdJbU52Ym5SbGJuUWlPaUI4TFFvZ0lDQWdXMlJsWm1GMWJIUmRDaUFnSUNCeVpXZHBiMjQ5ZFhNdGQyVnpkQzB4Q2lBZ0luQmhkR2dpT2lBaUwzSnZiM1F2TG1GM2N5OWpiMjVtYVdjaUNpQWdJbkJsY20xcGMzTnBiMjV6SWpvZ0lqQTJNREFpQ2kwZ0ltTnZiblJsYm5RaU9pQjhDaUFnSUNBaWNIVndjR1YwWDJWdWRtbHliMjV0Wlc1MElqb2dJbkJ5YjJSMVkzUnBiMjRpQ2lBZ0lDQWljSFZ3Y0dWMFgzSnZiR1VpT2lBaWFuVnRjR2h2YzNRaUNpQWdJbkJoZEdnaU9pQWlMMlYwWXk5d2RYQndaWFJzWVdKekwyWmhZM1JsY2k5bVlXTjBjeTVrTDNCMWNIQmxkQzU1WVcxc0lnb2dJQ0p3WlhKdGFYTnphVzl1Y3lJNklDSXdOalEwSWdvTkNpMHRUVWxOUlVKUFZVNUVRVkpaTFMwTkNnPT1cIiAtPiBcIlEyOXVkR1Z1ZEMxVWVYQmxPaUJ0ZFd4MGFYQmhjblF2YldsNFpXUTdJR0p2ZFc1a1lYSjVQU0pOU1UxRlFrOVZUa1JCVWxraUNrMUpUVVV0Vm1WeWMybHZiam9nTVM0d0RRb05DaTB0VFVsTlJVSlBWVTVFUVZKWkRRcERiMjUwWlc1MExWUnlZVzV6Wm1WeUxVVnVZMjlrYVc1bk9pQTNZbWwwRFFwRGIyNTBaVzUwTFZSNWNHVTZJSFJsZUhRdlkyeHZkV1F0WTI5dVptbG5EUXBOYVcxbExWWmxjbk5wYjI0NklERXVNQTBLRFFvalkyeHZkV1F0WTI5dVptbG5DaUpoY0hRaU9nb2dJQ0p6YjNWeVkyVnpJam9LSUNBZ0lDSnBibVp5WVdodmRYTmxJam9LSUNBZ0lDQWdJbXRsZVNJNklId0tJQ0FnSUNBZ0lDQXRMUzB0TFVKRlIwbE9JRkJIVUNCUVZVSk1TVU1nUzBWWklFSk1UME5MTFMwdExTMEtDaUFnSUNBZ0lDQWdiVkZKVGtKSFV6ZEdkR3RDUlVGRVJpdFpiVVJuTmxGMmMzWTFWalphVVhjclVXaDRaRlIyYWsxWVpVeERPVlEyVWtaU1ZrUTVORGR4UzNwMFRrNVJiZ29nSUNBZ0lDQWdJQ3RCTDNsNGNISk1RVzFYTWpWVmRTOHhNVzlEYzNwT1ZrbEpZVkl6VDFrNFRYUjVhV3hpUTNSNlZXdENlblpYWkd4WU0waDJWSGM1TVV4d09HSjRWVXdLSUNBZ0lDQWdJQ0JGV0U5Tk9XNXpZM0ZQY2s5MlprSnFZVzV3YkV0RVJVdFFUVmsyZGtsYU0ydHdNWEpWYzBOT1IweENUREI0TWt0YVoxVTRNSFZzVW5OTlRUaHhia0pPQ2lBZ0lDQWdJQ0FnYTNCVWFVRmxXRXRQUlZaMFVucHNWMngyVDBaTVNqZHdXVVIyWVZvd1ZXZElVMVoxUlN0YWEyeGtjVTlrVEV4U2NFdHJaRWwyU2xCamExaHhURFY0VkFvZ0lDQWdJQ0FnSUZWMlYxUlhNV1Z1UmtGSVpEVXJUbEY0VFc1RFlUTnBhMnBSVmpORVZHeEZhbk5uVEV4UlltSjVjMWhxV0ZCeU5sQkpVSE15T1dOVVkyWnZjVFF6TVU4S0lDQWdJQ0FnSUNCMFVqUkVjbHBDTkhaTlJVOUJPRGhVYlV0Q2EwVnBUVWNyYVVJNVkycDZOWGRDU1hWTmRUazFXbTF2U25oa2RtcFFVamN5UmxsTFozSkRXRTUwVG1oa0NpQWdJQ0FnSUNBZ1ZtVnlSVkoyY0V4VWFHUmhVbTFhWjJrM2JIa3JSSFpyV1RkTWNYbEtVSFprU0dOeGVHVmtaMFp1VUV0U05GUXJaMU5SYldKVlVHUTVjWEZrU2xJd1VRb2dJQ0FnSUNBZ0lFdHNMMUJ0ZEhWVEwzYzVaM2t5V2pSaGVUQlJTVXR5VGtKNlVYaG9RVGhNUkZwd2NERnlkV1pEU2pVcldrMWxaamt3ZGtod2QzaE5LMDloVUhKNVRtd0tJQ0FnSUNBZ0lDQkZaRVJYTjFsUk9HWjFRalZ1VUhGcWQxVkJjRzFzV1ZsTVNsbHNaRGQyU2pjNVJVbDRMM05xWjJnMlJ5dEpSbWx0TjNoU04xZHBVVVl2YmtwbGRtWnhDaUFnSUNBZ0lDQWdkbnBaVHpkdmNpOUhTVU5pTm1WYWQzWlFaSFI1TnpsSWJWWmxVSEZGVkd4RVZUQXdiM2x2Y0ZkNVZITlplVk5aUkZOSWJpODBaRzlVZFhnNGRpdEdMd29nSUNBZ0lDQWdJRmxsZVdKMlozRmljbWxJTjJsVFJqaEllSGRGUm1WRWFuSk5kRlZVU0hOWVF6TTFSRWhHWlUxRGFFcHZlSE41UzNZME9Fb3JZa2xIUm5kQlVrRlJRVUlLSUNBZ0lDQWdJQ0IwUXpGS1ltMWFlVmxWYUhaa1dFNXNTVVpDYUZreWRHaGFNbFo1U1VSNGQxbFhUbkpaVjJSc1kydENjR0p0V25sWlYyaDJaRmhPYkV4dFRuWmlWRFpLQ2lBZ0lDQWdJQ0FnUVd4UlJVVjNSVXRCUkRSWFNWRlRhVTVvTld0Wk0zYzRWekJuUVVZNFdHZDFTbUZ2ZUdaalJEZDNWVU5hVEhOWE1sRkpZa0YzVlVwQk9FcHVRVUZWVEFvZ0lDQWdJQ0FnSUVOUlowaEJaMWxXUTJkclNVTjNTVVZHWjBsRVFWRkpaVUZSU1ZoblFVRkxRMUpFWjNWS1lXOTRabU5FTjNkaU4wUXZPV1Z1WW5SUE1VUkZVVzR4VUhRS0lDQWdJQ0FnSUNCb1oydDBTQ3RKY21KQ1pGbFNTR3MzTVdsc01taGlibTFCWW05TWEyc3hZV3N2WVdGUldTOVlVVVJLUm1oeVFUZHFUV3RRVEU5RFVtVnZkRWhwVVcxMkNpQWdJQ0FnSUNBZ01WVm1jVVJqVFRKbFVUUXZlREJPT1VZeVJFeFZVMnQxZDNjeE1UZDJkSFJWYjBKNGFYSkNOekp3VHpCVUwyeGtPVzh6T1ZOSVRVTXZSR1pyTm5rMmFBb2dJQ0FnSUNBZ0lIUlVSM0Y0VEdkb09Hb3pSRk41VHpWRlJYSktUR0V2TTBKMlRYRnlOR2x4WWpOUVZIZE9aVVJTUldwaGRsRkthRmhUZGtWR2FubEJRMjl2T1dRM2NuTUtJQ0FnSUNBZ0lDQTNiR2hEWW1KVFVHcG5WR05ITDFCRFpucE1jak0zVVhsNldHbFVVaTlVZDJwcGQxWmtWR2hrUTFNdlEwdHVjMjlOT0c1blNIaHFXRmx3U3pkTk5uZG5DaUFnSUNBZ0lDQWdkSHBCT0VwclNGcHlOVTF3YTNKUVIzSm5VV1YyYUVwQ1RHdElVaTlxWTNOaFlVSmFUamR1ZHpoaFpVaGpkM2ROTkM5RGFFaEplVnBrVVRreE1EVTVjQW9nSUNBZ0lDQWdJRTlOWVZsdFYyMXFVRkZtY1RGeVQyNUJRWFpCTVhoWGR5dFVXazU2U0dkWFNYRTBkblZ6ZURkUFFuWnlSbk5XWlZwT2MzRmtOMDloTkhCeWRGWlhaekFLSUNBZ0lDQWdJQ0E1TVdOTFdrcHZMMDkyTm05d1RTOTNSRmRPTW5sQ2JtdHRRa04zWVZod2IwZzFUa1JSTWpKaWFHNUhWRXBsU1Zka1pXazRWVk5IY0haQ2ExUjRRa2t5Q2lBZ0lDQWdJQ0FnV0RNeWNIbFBiVnBFYmpneFRESjZUVEpwYjA1MloxaEpZalYxTlhScVlqbE9UMmxCZERadlZ6QkhNSGd3TUdSbmNqTnlObkIxT0hGdFRYZHJRbFpDUXdvZ0lDQWdJQ0FnSUhaWGQwVnRZWGhSYm10VWFHNWlRV1ExTjFaaVlYUTBMeTkxUkdOSVJuQkVZVUpRY0VaWFpVTk1NbVJtUkZOeVV6bHBhVXMyU3pGV2EzWkhURzlZYURnS0lDQWdJQ0FnSUNCTmNFcHhhbTlrWkhCbVRtZzBkWGxtZWt0NVRrVXhaSEpSTWpsdFkzZG1TV3g2V0c5UWNtSXdPVmMyV2tod2JTdDBjV1E0VFdzM01EZDZkM05rUmtkU0NpQWdJQ0FnSUNBZ2NWSnplRzEwVUc0NVNqRnlaVmxhYVZaMVJUVkhNalptTVdGTFZGSTNhME5FVVZKcmRYaGlXa0ZTUVVFMEt6bHJialJ6YlVKWVdtTk5NSFpHY1RsU09Bb2dJQ0FnSUNBZ0lESTBXRXRhZEZSaFZtMVdiMVpLVFZKUlRUUTBjVmRTSzNNdlV6Qk5lblppVHpWMU1HTlRWbFJvV1RZMVdYcE5USE01TWpCVldUWjFSM0J2VXpKYVdYY0tJQ0FnSUNBZ0lDQkpUV2x3YTJGQ0t6SkdOa0k0VWpkV04yNXNMMU5uWVZoSFlUSk5aWGhyUXpkM2REWmliRVppWVhjM2NHSjJTU3RwU1RsM1V6aENTMGhuVFVSNlpEQkdDaUFnSUNBZ0lDQWdWR3BUY1RsMlpHdFdhMlkzZVVremFFVjNiR3hZTjNwVU5rbE1UM1pyYms1SFltOXpNR1JHU1RreVkwSlhVWE1yYVZoUU5UQjRSRlpwZERNck9XMURSQW9nSUNBZ0lDQWdJSEoxVjFaWmF6Y3piWFpUUlhwR1kzVllRM2xpUzBvMVZTOXVlbE5STnpCS2IxRnRVMUJqTlRCU1VXcDFTRWRrZW13dldYcEhSbUZHYmpWNlNWbzFjRkFLSUNBZ0lDQWdJQ0JyTlZNclMxUlpaV3Q2WTJsU2EwaDZZbVZoTlZCcUswRTJTMXBwYkV0cU5YbHJRVkpHZW5jclExQjRjWE4xWldwRWEyazNRU3RoTTIwelYwZHhLMjF0Q2lBZ0lDQWdJQ0FnUVd0c1VUUlpRbU52YkhwT1QzQm5WMk5zU1ZOMVJUTmtOV3RuZEdGS1FVTkpaM1JsT0RkR05sRkNRbk5yT0c5RVFrWlJRMjVhYlc5UGFYSnNVMnhpWmdvZ0lDQWdJQ0FnSUVwMVJEWm1Wa05LZFRKNldUZFVhRTR4VHpCdlYxUjNRV0ZPUVhaTk5UVkRURlIyTm5NelJtMTBVamt5Ykc1c1VVUkdkVW9yWm1vNE5qTmpObkY0TVRRS0lDQWdJQ0FnSUNCR2RVODBiVTAzWlhWVE1EaDNSMmRXUjIwNU1YZEJOMkpaYkRSaGFIaERObE15UWtkQ05VWjJhMXBtZWtKQ2QycHpabTFWVjBoQmRUZFdVbHBLZUd0WUNpQWdJQ0FnSUNBZ1NuQTJPVFpQVkdSU00xSm1TVGRKV2paUFZ6WjBSMFZNYVdwemQxZGlZbHBZWWpWWVVsZEZWems1ZGxkUE4wNUpTelp6VDNab1RVUk9jRGxpVTAxMVlnb2dJQ0FnSUNBZ0lGaFFNMUJpVUhobmVWUXdZbTF6Y3pCNWQwNVpkM1ZqYm1aamJVUlljVkJXZFROSFpIUTFNMkYwTVN0b1N6ZHRiRzVSTTNWVmN6VmxWa1ZQU1VodVNtMEtJQ0FnSUNBZ0lDQm1NWFJ5UkdkblUxUkZOMlp1YTNnMlEzcHNLMmxOYTBGRlVVVkJRVmxyUTFCQlVWbEJVVzlCU21oWmFFSkxTVEpJYlZKcVprUjRZbE5CUVZoNFpVTTBDaUFnSUNBZ0lDQWdiSEZxUmpsM1VIWkNVVXByZFhoaVdrRm9jMDFDVVd0RWQyMWpRVUZCYjBwRlQwTTBiSEZxUmpsM1VIWTRVMUZRTDJwelVXWktRMVZJY21wd1dEUm1VQW9nSUNBZ0lDQWdJREJPZEZaNWNXeERjbkV4VDIxTVVEZENUSEpZY2tONGIwRkdVbUkyTkZsS1ZXUlhhelZRTXpWck9YZHFNa0pSYW5CcVkwNXFNbWxyT0RCR2IyOHdNa1VLSUNBZ0lDQWdJQ0I1WXl0UWVsY3ZOSFI2Vm5aa2VGSnlSWHB6VDBadEsyMU5VaXRzYkZWSVFVdDZRbUUyVVVKNFNGUXdiMlpNTjNBMVdGbFVkVTFPYmxsdksxQnFWazF0Q2lBZ0lDQWdJQ0FnYWxBelZFVktSMWxZV1cxMWFFZG1ZV0ZLV25CcVRHMUtSbkZ3TlRsNEx5OWtjMDFJWlV4eFZVTm9kMkkyUTJjMlJIVnJRV2xvWlVGek0xQXJjbGh2TXdvZ0lDQWdJQ0FnSUhSQ2JrRTBTa05EYVZoU055OHZNRmRsZWxKdlUxQmtZV3hPWlcwMGRuTTRVRlE0TjNOdVNHSkViR2xHVFZabU9IY3JabXR6U1c1eGRtOTBhVkpFU1RRS0lDQWdJQ0FnSUNCUlFuSkNabk16VG1SbFdsY3ZkRzExY0U5aFdrcFNla2hFZG5aTFltY3ZMMDgyYVhBeFlWQjJTVXhYZGxSRVRUaExZMUZEVVVWVFlWZHJRMkpKTVhWakNpQWdJQ0FnSUNBZ2NtbDZRVTFpYkZSQ01tZDVkemw1YjJwRGNGWkRUVUpZWkdsNlFYRnhlV3cxV2xaeWR6UXJXQzlwTURsSmMwNTBPR2hCT1M4MVVsazNkak5qTjFveVF3b2dJQ0FnSUNBZ0lGaDVNbmhMVjIxMFRFazVibXhQVTFOM1ZYaENOVFkyU1RJNWJGWkxRa3hWYlZodFVXWnVVa2xKU0VOcFNrUllXVVpFVUM4MlRHWjJPU3R0YUVWWFZUZ0tJQ0FnSUNBZ0lDQnhaV1F6ZUdod1pVNVRRVWw2UVN0TlZHeHFkR2xTYlc5eWVIQmtaR2xZWW5SRFlXWmpVR3d2U2pOWU1FSXdOMlpqWTBwYWQxcHpRMWxEY0hSTWVURmpDaUFnSUNBZ0lDQWdlWFpXWVU0clJVSnRhbTlEY0ROcWREWjNUR1UwZUdOc2NWVXpRVU4zZWk4NFZFUkViWFJLTjFWVlpHdzNUV1JyYVhCUldqSTNPRXd5YTNCc05tODJNUW9nSUNBZ0lDQWdJRTFHTW1aWVJEZG1XazFsV21aRmR6WnNkVEJDUmpWdFdqQXZZMmd6U0hoWVpWcHZXR2xtTnpsbk1qVjJXbTFUWkZjNU4zQmpaV1YzVUd4MmJFVlVSbEVLSUNBZ0lDQWdJQ0ExTlhCTmIzSlJlVlZVUlZGRFVUTkZRM3BJV1ZOdVRDOVViVmMzQ2lBZ0lDQWdJQ0FnUFNzd1VtTUtJQ0FnSUNBZ0lDQXRMUzB0TFVWT1JDQlFSMUFnVUZWQ1RFbERJRXRGV1NCQ1RFOURTeTB0TFMwdENpQWdJQ0FnSUNKemIzVnlZMlVpT2lBaVpHVmlJRnR6YVdkdVpXUXRZbms5SkV0RldWOUdTVXhGWFNCb2RIUndjem92TDNKbGJHVmhjMlV0YW1GdGJYa3VhVzVtY21Gb2IzVnpaUzVqYjIwdklDUlNSVXhGUVZORkNpQWdJQ0FnSUNBZ2JXRnBiaUlLSW5CaFkydGhaMlZmZFhCa1lYUmxJam9nZEhKMVpRb2ljR0ZqYTJGblpYTWlPZ290SUNKd2RYQndaWFF0WTI5a1pTSUtMU0FpYVc1bWNtRm9iM1Z6WlMxMGIyOXNhMmwwSWdvaWNIVndjR1YwSWpvS0lDQWlZMjlzYkdWamRHbHZiaUk2SUNKd2RYQndaWFE0SWdvZ0lDSnBibk4wWVd4c0lqb2dkSEoxWlFvZ0lDSnBibk4wWVd4c1gzUjVjR1VpT2lBaVlXbHZJZ29nSUNKd1lXTnJZV2RsWDI1aGJXVWlPaUFpY0hWd2NHVjBMV0ZuWlc1MElnb2dJQ0p6ZEdGeWRGOXpaWEoyYVdObElqb2dabUZzYzJVS0luSjFibU50WkNJNkNpMGdMU0FpYVdndGNIVndjR1YwSWdvZ0lDMGdJaTB0Wlc1MmFYSnZibTFsYm5RaUNpQWdMU0FpY0hKdlpIVmpkR2x2YmlJS0lDQXRJQ0l0TFhKdmIzUXRaR2x5WldOMGIzSjVJZ29nSUMwZ0lpOXZjSFF2Y0hWd2NHVjBMV052WkdVaUNpQWdMU0FpTFMxb2FXVnlZUzFqYjI1bWFXY2lDaUFnTFNBaWUzSnZiM1JmWkdseVpXTjBiM0o1ZlM5bGJuWnBjbTl1YldWdWRITXZlMlZ1ZG1seWIyNXRaVzUwZlM5b2FXVnlZUzU1WVcxc0lnb2dJQzBnSWkwdGJXOWtkV3hsTFhCaGRHZ2lDaUFnTFNBaWUzSnZiM1JmWkdseVpXTjBiM0o1ZlM5dGIyUjFiR1Z6SWdvZ0lDMGdJbUZ3Y0d4NUlnb2lkM0pwZEdWZlptbHNaWE1pT2dvdElDSmpiMjUwWlc1MElqb2dmQzBLSUNBZ0lGdGtaV1poZFd4MFhRb2dJQ0FnY21WbmFXOXVQWFZ6TFhkbGMzUXRNUW9nSUNKd1lYUm9Jam9nSWk5eWIyOTBMeTVoZDNNdlkyOXVabWxuSWdvZ0lDSndaWEp0YVhOemFXOXVjeUk2SUNJd05qQXdJZ290SUNKamIyNTBaVzUwSWpvZ2ZBb2dJQ0FnSW5CMWNIQmxkRjlsYm5acGNtOXViV1Z1ZENJNklDSndjbTlrZFdOMGFXOXVJZ29nSUNBZ0luQjFjSEJsZEY5eWIyeGxJam9nSW1wMWJYQm9iM04wSWdvZ0lDSndZWFJvSWpvZ0lpOWxkR012Y0hWd2NHVjBiR0ZpY3k5bVlXTjBaWEl2Wm1GamRITXVaQzl3ZFhCd1pYUXVlV0Z0YkNJS0lDQWljR1Z5YldsemMybHZibk1pT2lBaU1EWTBOQ0lLRFFvdExVMUpUVVZDVDFWT1JFRlNXUzB0RFFvPVwiXG4gICAgICAgICMgKDExIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgICAjICgxIHVuY2hhbmdlZCBibG9jayBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0LmF3c19zM19vYmplY3QubGFtYmRhX3BhY2thZ2UgbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwiYXdzX3MzX29iamVjdFwiIFwibGFtYmRhX3BhY2thZ2VcIiB7XG4gICAgICArIGFjbCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGJ1Y2tldF9rZXlfZW5hYmxlZCAgICAgPSBmYWxzZSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNoZWNrc3VtX2NyYzMyICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNoZWNrc3VtX2NyYzMyYyAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNoZWNrc3VtX3NoYTEgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNoZWNrc3VtX3NoYTI1NiAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGNvbnRlbnRfdHlwZSAgICAgICAgICAgPSBcImJpbmFyeS9vY3RldC1zdHJlYW1cIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGV0YWcgICAgICAgICAgICAgICAgICAgPSBcImExMDMxMWZhOTZlNTlhN2IxOTljMmI4ZWIxYjA0MWI5LTNcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGlkICAgICAgICAgICAgICAgICAgICAgPSBcIjNhYTczOGYwLTIyN2QtNmYwNi0xMWE1LWMxNzU0NDI4Y2JkYi56aXBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGtleSAgICAgICAgICAgICAgICAgICAgPSBcIjNhYTczOGYwLTIyN2QtNmYwNi0xMWE1LWMxNzU0NDI4Y2JkYi56aXBcIiAjIGZvcmNlcyByZXBsYWNlbWVudCAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICArIGttc19rZXlfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAtIG1ldGFkYXRhICAgICAgICAgICAgICAgPSB7fSAtPiBudWxsXG4gICAgICB+IHNlcnZlcl9zaWRlX2VuY3J5cHRpb24gPSBcIkFFUzI1NlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gc291cmNlICAgICAgICAgICAgICAgICA9IFwibW9kdWxlcy9qdW1waG9zdC8zYWE3MzhmMC0yMjdkLTZmMDYtMTFhNS1jMTc1NDQyOGNiZGIuemlwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBzdG9yYWdlX2NsYXNzICAgICAgICAgID0gXCJTVEFOREFSRFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGxcbiAgICAgICsgdmVyc2lvbl9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoMyB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0Lm51bGxfcmVzb3VyY2UuaW5zdGFsbF9weXRob25fZGVwZW5kZW5jaWVzIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcIm51bGxfcmVzb3VyY2VcIiBcImluc3RhbGxfcHl0aG9uX2RlcGVuZGVuY2llc1wiIHtcbiAgICAgIH4gaWQgICAgICAgPSBcIjQxMjk1ODUwOTY3NTgyNTk3NDVcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHRyaWdnZXJzID0geyAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgICAgIH4gXCJkZXBlbmRlbmNpZXNfdmVyc2lvblwiID0gXCI3Y2I4MTNjNGVlNWI0MGI3N2ViOThjMTQ3NDlmMGZkY1wiIC0+IFwiNzE1YTBmNzMxMGFlNGRhYmY5YjcxMDgwMjMzOWRjZDVcIlxuICAgICAgICAgICAgIyAoMSB1bmNoYW5nZWQgZWxlbWVudCBoaWRkZW4pXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QucmFuZG9tX3V1aWQubGFtZGFfc3JjX2hhc2ggbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwicmFuZG9tX3V1aWRcIiBcImxhbWRhX3NyY19oYXNoXCIge1xuICAgICAgfiBpZCAgICAgID0gXCIzYWE3MzhmMC0yMjdkLTZmMDYtMTFhNS1jMTc1NDQyOGNiZGJcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGtlZXBlcnMgPSB7ICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICAgICAgfiBcInJlcXVpcmVtZW50cy50eHRcIiA9IFwiN2NiODEzYzRlZTViNDBiNzdlYjk4YzE0NzQ5ZjBmZGNcIiAtPiBcIjcxNWEwZjczMTBhZTRkYWJmOWI3MTA4MDIzMzlkY2Q1XCJcbiAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGVsZW1lbnQgaGlkZGVuKVxuICAgICAgICB9XG4gICAgICB+IHJlc3VsdCAgPSBcIjNhYTczOGYwLTIyN2QtNmYwNi0xMWE1LWMxNzU0NDI4Y2JkYlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmV4dHJhW1wicmVxdWlyZWRcIl0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcImV4dHJhXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb2xlICAgICAgID0gXCJqdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyXCJcbiAgICB9XG5cblBsYW46IDUgdG8gYWRkLCA0IHRvIGNoYW5nZSwgMyB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBkYXRhLnRlcnJhZm9ybV9yZW1vdGVfc3RhdGUuY2ljZDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5udWxsX3Jlc291cmNlLmluc3RhbGxfcHl0aG9uX2RlcGVuZGVuY2llczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NDEyOTU4NTA5Njc1ODI1OTc0NV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLnJhbmRvbV9wYXNzd29yZC5wYXNzcGhyYXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ub25lXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0ucmFuZG9tX3Bhc3N3b3JkLnBhc3NwaHJhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5vbmVdJTBBbW9kdWxlLmp1bXBob3N0LnJhbmRvbV91dWlkLmxhbWRhX3NyY19oYXNoOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0zYWE3MzhmMC0yMjdkLTZmMDYtMTFhNS1jMTc1NDQyOGNiZGJdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfYWNtX2NlcnRpZmljYXRlLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLWVhc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvNDAyODUyZTEtNzA1NC00Y2VhLTgwYWMtM2NjYmVlNzJhMzk4XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX2FjbV9jZXJ0aWZpY2F0ZS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmFjbTp1cy1lYXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlLzJlZWQ1M2QzLWUxYWQtNDc0My1hY2U1LTg5YzE5M2NkM2M2NV0lMEFkYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmF3c19zM19idWNrZXQubGFtYmRhX3RtcDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1qdW1waG9zdC1sYW1iZGEtMjAyMzA3MTMyMzM0NTk2NzU4MDAwMDAwMDFdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbF0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5qdW1waG9zdF9wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19hbWkudWJ1bnR1OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODUxMTE5NDI3XSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0X3Blcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjE4MzE1NDAyXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldC5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXldJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF91c2VyZGF0YS5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5rZXk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6cGFja2FnZXIta2V5LWphbW15LVhyVFdyUF0lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3VzZXJkYXRhLmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3kuQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0LnJlcG8tbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15LWxvZ3NdJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3pvbmUuaW5mcmFob3VzZV9jb206IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19jbG91ZGZyb250X2NhY2hlX3BvbGljeS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1iMDRhZmY0NS00OGUxLTQ1MDEtOTBkMy05OThjOWZhMWYyNjRdJTBBZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YW1pLTBmMzI0ZTFjZDVjNDQ2NWM4XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5rZXk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6cGFja2FnZXIta2V5LWZvY2FsLVhyVFdyUF0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWVfcm9sZTogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZV9yb2xlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNjkwMjU1NDU1XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldC5yZXBvLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbC1sb2dzXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19hbWkudWJ1bnR1OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hbWktMGYzMjRlMWNkNWM0NDY1YzhdJTBBbW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFkYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfY2xvdWRmcm9udF9jYWNoZV9wb2xpY3kuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NWRiNDk0ZGQtNTQ2Yi00MjMxLWEwYzctMTMzYjI0NWFkYTQ5XSUwQWRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTU4NTM0NjgzMl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWphbW15LXhhNlBUR10lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeS5BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L3NlcnZpY2Utcm9sZS9BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGVdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LnBhc3NwaHJhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6cGFja2FnZXItcGFzc3BocmFzZS1mb2NhbC1nenhRUHFdJTBBZGF0YS50ZXJyYWZvcm1fcmVtb3RlX3N0YXRlLmNpY2Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMnMlMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00OTMzNzA4MjY0MjRdJTBBYXdzX2tleV9wYWlyLmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hbGVrc10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfdnBjLnZwYzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dnBjLTA4ZTE5ZDg1OWMyNmQxOGIyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD04MzczMTkwNF0lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0MjAyMzA3MTAwNDMwNDQ3NjEwMDAwMDAwMDJdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF91c2VyZGF0YS5kYXRhLmNsb3VkaW5pdF9jb25maWcuY29uZmlnOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF91c2VyZGF0YS5kYXRhLmNsb3VkaW5pdF9jb25maWcuY29uZmlnOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNjcxNDMxMzc4XSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3JvbGUuaWFtX2Zvcl9sYW1iZGE6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlhbV9mb3JfbGFtYmRhXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQubXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9NWF0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC5zcGY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9TUEZdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQudHh0X3NwZjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX1RYVF0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnR4dF9ka2ltOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfZ29vZ2xlLl9kb21haW5rZXkuaW5mcmFob3VzZS5jb21fVFhUXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2loLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1naXRodWJdJTBBZGF0YS5hd3Nfcm91dGU1M196b25lLmNpY2QtaWgtY29tOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWphbW15LXhhNlBUR3xENkFCQ0IyQi1GODUwLTQ0ODctQTc2NC0wNzI2MzczNjMyM0VdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWZvY2FsLWd6eFFQcXw2NTg2RUIxMy03OUMyLTQyNEQtQUZFRC02ODEwRTYxMTU2RDddJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1naXRodWJdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcG9saWN5LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2p1bXBob3N0MjAyMzA3MTAwNDMwNDQ3NjA0MDAwMDAwMDFdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1faW5zdGFuY2VfcHJvZmlsZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdF0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTAxNzU0MzQ4NzgwMDAwMDAwMDFdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wdXBwZXQtY29kZS1naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wdXBwZXQtY29kZS1naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNjk1MTcwNjU2XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaW5mcmFob3VzZS1jb20tZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaW5mcmFob3VzZS1jb20tZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTc1NDIxNDE2NF0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM1OTIyMDU3NzJdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19zM19vYmplY3QubGFtYmRhX3BhY2thZ2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTNhYTczOGYwLTIyN2QtNmYwNi0xMWE1LWMxNzU0NDI4Y2JkYi56aXBdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWp1bXBob3N0LWxhbWJkYS0yMDIzMDcxMzIzMzQ1OTY3NTgwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0MjAyMzA3MTAwNDMwNDQ3NjEwMDAwMDAwMDItMjAyMzA4MTAxNTU3MjE2MjQzMDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzkxMTg0NDg2OF0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD03MDk4NDEzOTFdJTBBYXdzX2lhbV9yb2xlLnB1cHBldC1jb2RlLWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHVwcGV0LWNvZGUtZ2l0aHViXSUwQWF3c19pYW1fcm9sZS5pbmZyYWhvdXNlLWNvbS1naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtY29tLWdpdGh1Yl0lMEFhd3NfaWFtX3JvbGUuaW5mcmFob3VzZS10b29sa2l0LWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0LWdpdGh1Yl0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3Nfcm91dGU1M196b25lLmp1bXBob3N0X3pvbmU6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJyZWxlYXNlLWphbW15LmluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfXzA0N2FlMjk5MjVlYzAyOTdlYWViZmVkZGM4ODZmMjM0LnJlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20uX0NOQU1FXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3JvdXRlNTNfcmVjb3JkLmNlcnRfdmFsaWRhdGlvbltcInJlbGVhc2UtZm9jYWwuaW5mcmFob3VzZS5jb21cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19fODdmMmVhZDNhYmY2ODEzNGM0OTdiZjUyNzE4ZTA3YjEucmVsZWFzZS1mb2NhbC5pbmZyYWhvdXNlLmNvbS5fQ05BTUVdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVpcGFsbG9jLTAyYjQyZTcwZDUyYTVkYjdmXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWdpdGh1Yl0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1naXRodWJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2ludGVybmV0X2dhdGV3YXkuaWc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlndy0wNzkwOTBlMDllZDVkYjU4Ml0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZGVmYXVsdF9yb3V0ZV90YWJsZS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGQ3MzM4M2FmZWI2YWQxNDJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2RlZmF1bHRfc2VjdXJpdHlfZ3JvdXAuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDhiOTYwYjg1ZjU5OTYxMDBdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDRhMTZlNzRkNWIxMmEzMzhdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTldJTBBbW9kdWxlLmp1bXBob3N0LmF3c19sYXVuY2hfdGVtcGxhdGUuanVtcGhvc3Q6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWx0LTAxYThlZjk2ODIyYjRiMDBiXSUwQWRhdGEuYXdzX3JvdXRlNTNfem9uZS5jaWNkLWloLWNvbTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9WjA2NzkwMDgyT1UwUE9QV09DUFo0XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wZGY4ODVkY2M5OTQxODc5OV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGY5MWRkMjY3NWU3YTE2YzNdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXldJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWxdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1YmxpYy1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3Nfcm91dGU1M196b25lLmp1bXBob3N0X3pvbmU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHVibGljLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDE4NDE3MTcyOF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHVibGljLWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX29iamVjdC5kaXN0cmlidXRpb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb25mL2Rpc3RyaWJ1dGlvbnNdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1YmxpYy1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE2OTM0NzM5NDZdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfb2JqZWN0LmRpc3RyaWJ1dGlvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvbmYvZGlzdHJpYnV0aW9uc10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXldJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF93ZWJzaXRlX2NvbmZpZ3VyYXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldF93ZWJzaXRlX2NvbmZpZ3VyYXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWdpdGh1Yi0yMDIzMDgxNzAxMDgxODI1ODIwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg5OTYyOTk1Ml0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjcxNDI2MDM3Nl0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1naXRodWItMjAyMzA4MTgwMzQxNTA5OTM0MDAwMDAwMDFdJTBBYXdzX3JvdXRlNTNfcmVjb3JkLmNpLWNkLW5zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfY2ktY2QuaW5mcmFob3VzZS5jb21fTlNdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5yZXBvLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teS1sb2dzXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldF9vd25lcnNoaXBfY29udHJvbHMucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWwtbG9nc10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuZGVmYXVsdF9tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZDczMzgzYWZlYjZhZDE0MjEwODAyODk0OTRdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19sYW1iZGFfZnVuY3Rpb24udXBkYXRlX2RuczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXBkYXRlX2Ruc10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNGExNmU3NGQ1YjEyYTMzODEwODAyODk0OTRdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MjAyMy0wNy0yNCAxODo1MTozOS4wNTEgKzAwMDAgVVRDXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTIwMjMtMDctMjQgMTg6NTE6MzkuNDQyICswMDAwIFVUQ10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW5dJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X2FjbC5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXkscHVibGljLXJlYWRdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X2FjbC5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWwscHVibGljLXJlYWRdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMDhhNDEwMTYwZTJkY2M1OTJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMDk5Yjk1OGFmMTk0ODVmMmJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX25hdF9nYXRld2F5Lm5hdF9nd1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1uYXQtMDhmYjliNTI2ODMyNzc5NDddJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X2FjbC5yZXBvLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teS1sb2dzLHByaXZhdGVdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X2FjbC5yZXBvLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbC1sb2dzLHByaXZhdGVdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfY2xvdWRmcm9udF9kaXN0cmlidXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9RTFJSUxXSVkwT1U3OEJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi0yMDIzMDcwOTE2NDMyMTMxOTkwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLTIwMjMwODE4MDM0MTU4OTg1MTAwMDAwMDAyXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX2Nsb3VkZnJvbnRfZGlzdHJpYnV0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUUxNjFRR0NQRTNKSU9LXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfZ3JvdXAuanVtcGhvc3Q6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LTIwMjMwNzEwMDQ1NTEyMTY1NDAwMDAwMDAxXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF9wb2xpY3kucHVibGljLWFjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldF9wb2xpY3kucHVibGljLWFjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX29iamVjdC5pbmRleC1odG1sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmRleC5odG1sXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX29iamVjdC5pbmRleC1odG1sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmRleC5odG1sXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX29iamVjdC5kZWItZ3BnLXB1YmxpYy1rZXk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPURFQi1HUEctS0VZLXJlbGVhc2UtZm9jYWwuaW5mcmFob3VzZS5jb21dJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfb2JqZWN0LmRlYi1ncGctcHVibGljLWtleTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9REVCLUdQRy1LRVktcmVsZWFzZS1qYW1teS5pbmZyYWhvdXNlLmNvbV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3ByaXZhdGVbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTkxMDgwMjg5NDk0XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3JvdXRlNTNfcmVjb3JkLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19yZWxlYXNlLWphbW15LmluZnJhaG91c2UuY29tX0FdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3Nfcm91dGU1M19yZWNvcmQucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX3JlbGVhc2UtZm9jYWwuaW5mcmFob3VzZS5jb21fQV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9mdW5jdGlvbl9ldmVudF9pbnZva2VfY29uZmlnLnVwZGF0ZV9kbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXVwZGF0ZV9kbnNdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19jbG91ZHdhdGNoX2xvZ19ncm91cC51cGRhdGVfZG5zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0vYXdzL2xhbWJkYS91cGRhdGVfZG5zXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfY2xvdWR3YXRjaF9ldmVudF9ydWxlLnNjYWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC1zY2FsZTIwMjMwNzExMTcyNzQ3NTA0NzAwMDAwMDAxXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfbGlmZWN5Y2xlX2hvb2subGF1bmNoaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sYXVuY2hpbmddJTBBbW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19saWZlY3ljbGVfaG9vay50ZXJtaW5hdGluZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVybWluYXRpbmddJTBBbW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcG9saWN5LmxhbWJkYV9wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvbGFtYmRhX3Blcm1pc3Npb25zMjAyMzA3MTExNjA1MTI3MjQyMDAwMDAwMDFdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5sYW1iZGFfcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlhbV9mb3JfbGFtYmRhLTIwMjMwNzExMTYwNTEzNDE2MTAwMDAwMDAyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGFja2FnZS1wdWJsaXNoZXI6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBhY2thZ2UtcHVibGlzaGVyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MDUwMDA2MDM3XSUwQWF3c19pYW1fcG9saWN5LnBhY2thZ2UtcHVibGlzaGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9wYWNrYWdlLXB1Ymxpc2hlcl0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaW5mcmFob3VzZS10b29sa2l0LWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0LWdpdGh1Yi0yMDIzMDcyODIxMTY0MjgzNjIwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucHVwcGV0LWNvZGUtZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wdXBwZXQtY29kZS1naXRodWItMjAyMzA4MDcxNzEyNDkyMDk5MDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmluZnJhaG91c2UtY29tLWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb20tZ2l0aHViLTIwMjMwODE5MjE0MTM5NzU2MzAwMDAwMDAxXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZXh0cmFbXCJwYWNrYWdlLXB1Ymxpc2hlclwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QyMDIzMDcxMDA0MzA0NDc2MTAwMDAwMDAwMi0yMDIzMDcyNDE4NTYxNDcxMDcwMDAwMDAwM10lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5sYW1iZGFfbG9nZ2luZzogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYV9sb2dnaW5nOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTExNDEzMDc1XSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3BvbGljeS5sYW1iZGFfbG9nZ2luZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvbGFtYmRhX2xvZ2dpbmcyMDIzMDcxMTE2MDUxMzc3ODMwMDAwMDAwM10lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmxhbWJkYV9sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYS0yMDIzMDcxMTE2MDUxNDI1MTEwMDAwMDAwNF0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9wZXJtaXNzaW9uLmFsbG93X2Nsb3Vkd2F0Y2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUFsbG93RXhlY3V0aW9uRnJvbUNsb3VkV2F0Y2gtb3V0XSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfY2xvdWR3YXRjaF9ldmVudF90YXJnZXQuc2NhbGUtb3V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC1zY2FsZTIwMjMwNzExMTcyNzQ3NTA0NzAwMDAwMDAxLXRlcnJhZm9ybS0yMDIzMDcxMTE3Mjc0NzYzMDkwMDAwMDAwMl0lMEElMEFUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uJTBBcGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOiUwQSAgKyBjcmVhdGUlMEEgIH4gdXBkYXRlIGluLXBsYWNlJTBBLS8rIGRlc3Ryb3kgYW5kIHRoZW4gY3JlYXRlIHJlcGxhY2VtZW50JTBBIDw9IHJlYWQgKGRhdGEgcmVzb3VyY2VzKSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QuZGF0YS5hcmNoaXZlX2ZpbGUubGFtYmRhIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pJTBBIDw9IGRhdGEgXCJhcmNoaXZlX2ZpbGVcIiBcImxhbWJkYVwiIHslMEEgICAgICArIGV4Y2x1ZGVzICAgICAgICAgICAgPSBbJTBBICAgICAgICAgICsgXCJfX3B5Y2FjaGVfX1wiLCUwQSAgICAgICAgXSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9iYXNlNjRzaGEyNTYgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfYmFzZTY0c2hhNTEyID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X21kNSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9wYXRoICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfc2hhICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X3NoYTI1NiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9zaGE1MTIgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfc2l6ZSAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc291cmNlX2RpciAgICAgICAgICA9IFwiLnRlcnJhZm9ybS9tb2R1bGVzL2p1bXBob3N0L3VwZGF0ZV9kbnNcIiUwQSAgICAgICsgdHlwZSAgICAgICAgICAgICAgICA9IFwiemlwXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5sYW1iZGEtcGVybWlzc2lvbnMgd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseSUwQSAgIyAoZGVwZW5kcyBvbiBhIHJlc291cmNlIG9yIGEgbW9kdWxlIHdpdGggY2hhbmdlcyBwZW5kaW5nKSUwQSA8PSBkYXRhIFwiYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnRcIiBcImxhbWJkYS1wZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGlkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBqc29uID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSUwQSAgICAgICsgc3RhdGVtZW50IHslMEEgICAgICAgICAgKyBhY3Rpb25zICAgPSBbJTBBICAgICAgICAgICAgICArIFwiYXV0b3NjYWxpbmc6Q29tcGxldGVMaWZlY3ljbGVBY3Rpb25cIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICAgICsgcmVzb3VyY2VzID0gWyUwQSAgICAgICAgICAgICAgKyBcImFybjphd3M6YXV0b3NjYWxpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDphdXRvU2NhbGluZ0dyb3VwOjAxMzI2ZTM2LTgzNjMtNDJhOC1iMDZkLWYwZDhkODQ4YTcyNzphdXRvU2NhbGluZ0dyb3VwTmFtZS9qdW1waG9zdC0yMDIzMDcxMDA0NTUxMjE2NTQwMDAwMDAwMVwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgIH0lMEEgICAgICArIHN0YXRlbWVudCB7JTBBICAgICAgICAgICsgYWN0aW9ucyAgID0gWyUwQSAgICAgICAgICAgICAgKyBcImVjMjpEZXNjcmliZUluc3RhbmNlc1wiLCUwQSAgICAgICAgICAgICAgKyBcImVjMjpEZXNjcmliZVRhZ3NcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICAgICsgcmVzb3VyY2VzID0gWyUwQSAgICAgICAgICAgICAgKyBcIipcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICB9JTBBICAgICAgKyBzdGF0ZW1lbnQgeyUwQSAgICAgICAgICArIGFjdGlvbnMgICA9IFslMEEgICAgICAgICAgICAgICsgXCJlYzI6Q3JlYXRlVGFnc1wiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgICAgKyByZXNvdXJjZXMgPSBbJTBBICAgICAgICAgICAgICArIFwiYXJuOmF3czplYzI6Kjo0OTMzNzA4MjY0MjQ6aW5zdGFuY2UvKlwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgIH0lMEEgICAgICArIHN0YXRlbWVudCB7JTBBICAgICAgICAgICsgYWN0aW9ucyAgID0gWyUwQSAgICAgICAgICAgICAgKyBcInJvdXRlNTM6Q2hhbmdlUmVzb3VyY2VSZWNvcmRTZXRzXCIsJTBBICAgICAgICAgICAgICArIFwicm91dGU1MzpMaXN0UmVzb3VyY2VSZWNvcmRTZXRzXCIsJTBBICAgICAgICAgICAgXSUwQSAgICAgICAgICArIHJlc291cmNlcyA9IFslMEEgICAgICAgICAgICAgICsgXCJhcm46YXdzOnJvdXRlNTM6Ojpob3N0ZWR6b25lL1owNzY2MjI1MUxIM1lSRjJFUk0zR1wiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yZXF1aXJlZF9wZXJtaXNzaW9ucyB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5JTBBICAjIChkZXBlbmRzIG9uIGEgcmVzb3VyY2Ugb3IgYSBtb2R1bGUgd2l0aCBjaGFuZ2VzIHBlbmRpbmcpJTBBIDw9IGRhdGEgXCJhd3NfaWFtX3BvbGljeV9kb2N1bWVudFwiIFwicmVxdWlyZWRfcGVybWlzc2lvbnNcIiB7JTBBICAgICAgKyBpZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsganNvbiA9IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIHN0YXRlbWVudCB7JTBBICAgICAgICAgICsgYWN0aW9ucyAgID0gWyUwQSAgICAgICAgICAgICAgKyBcImF1dG9zY2FsaW5nOkRlc2NyaWJlQXV0b1NjYWxpbmdJbnN0YW5jZXNcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICAgICsgcmVzb3VyY2VzID0gWyUwQSAgICAgICAgICAgICAgKyBcImFybjphd3M6YXV0b3NjYWxpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDphdXRvU2NhbGluZ0dyb3VwOjAxMzI2ZTM2LTgzNjMtNDJhOC1iMDZkLWYwZDhkODQ4YTcyNzphdXRvU2NhbGluZ0dyb3VwTmFtZS9qdW1waG9zdC0yMDIzMDcxMDA0NTUxMjE2NTQwMDAwMDAwMVwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLmp1bXBob3N0IHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19hdXRvc2NhbGluZ19ncm91cFwiIFwianVtcGhvc3RcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwianVtcGhvc3QtMjAyMzA3MTAwNDU1MTIxNjU0MDAwMDAwMDFcIiUwQSAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImp1bXBob3N0LTIwMjMwNzEwMDQ1NTEyMTY1NDAwMDAwMDAxXCIlMEEgICAgICAgICMgKDI3IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEElMEEgICAgICB+IGxhdW5jaF90ZW1wbGF0ZSB7JTBBICAgICAgICAgICAgaWQgICAgICA9IFwibHQtMDFhOGVmOTY4MjJiNGIwMGJcIiUwQSAgICAgICAgICAgIG5hbWUgICAgPSBcImp1bXBob3N0LTIwMjMwNzEwMDQ0OTI2NjA1ODAwMDAwMDAxXCIlMEEgICAgICAgICAgfiB2ZXJzaW9uID0gXCIyOFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgIH0lMEElMEEgICAgICAgICMgKDIgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcG9saWN5LmxhbWJkYV9wZXJtaXNzaW9ucyB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEEgIH4gcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwibGFtYmRhX3Blcm1pc3Npb25zXCIgeyUwQSAgICAgICAgaWQgICAgICAgICAgPSBcImFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2xhbWJkYV9wZXJtaXNzaW9uczIwMjMwNzExMTYwNTEyNzI0MjAwMDAwMDAxXCIlMEEgICAgICAgIG5hbWUgICAgICAgID0gXCJsYW1iZGFfcGVybWlzc2lvbnMyMDIzMDcxMTE2MDUxMjcyNDIwMDAwMDAwMVwiJTBBICAgICAgfiBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgLSBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgLSB7JTBBICAgICAgICAgICAgICAgICAgICAgIC0gQWN0aW9uICAgPSBcImF1dG9zY2FsaW5nOkNvbXBsZXRlTGlmZWN5Y2xlQWN0aW9uXCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOmF1dG9zY2FsaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6YXV0b1NjYWxpbmdHcm91cDowMTMyNmUzNi04MzYzLTQyYTgtYjA2ZC1mMGQ4ZDg0OGE3Mjc6YXV0b1NjYWxpbmdHcm91cE5hbWUvanVtcGhvc3QtMjAyMzA3MTAwNDU1MTIxNjU0MDAwMDAwMDFcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgICAtIHslMEEgICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJlYzI6RGVzY3JpYmVUYWdzXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiZWMyOkRlc2NyaWJlSW5zdGFuY2VzXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgICAtIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gUmVzb3VyY2UgPSBcIipcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgICAtIHslMEEgICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFwiZWMyOkNyZWF0ZVRhZ3NcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gUmVzb3VyY2UgPSBcImFybjphd3M6ZWMyOio6NDkzMzcwODI2NDI0Omluc3RhbmNlLypcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFNpZCAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgICAtIHslMEEgICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJyb3V0ZTUzOkxpc3RSZXNvdXJjZVJlY29yZFNldHNcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJyb3V0ZTUzOkNoYW5nZVJlc291cmNlUmVjb3JkU2V0c1wiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIFJlc291cmNlID0gXCJhcm46YXdzOnJvdXRlNTM6Ojpob3N0ZWR6b25lL1owNzY2MjI1MUxIM1lSRjJFUk0zR1wiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAtIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICB0YWdzICAgICAgICA9IHt9JTBBICAgICAgICAjICg2IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9wb2xpY3kucmVxdWlyZWQgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInJlcXVpcmVkXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiJTBBICAgICAgKyBwb2xpY3kgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9mdW5jdGlvbi51cGRhdGVfZG5zIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19sYW1iZGFfZnVuY3Rpb25cIiBcInVwZGF0ZV9kbnNcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInVwZGF0ZV9kbnNcIiUwQSAgICAgIH4gbGFzdF9tb2RpZmllZCAgICAgICAgICAgICAgICAgID0gXCIyMDIzLTA4LTAyVDIzOjEyOjUyLjI4MSswMDAwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gczNfa2V5ICAgICAgICAgICAgICAgICAgICAgICAgID0gXCIzYWE3MzhmMC0yMjdkLTZmMDYtMTFhNS1jMTc1NDQyOGNiZGIuemlwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge30lMEEgICAgICAgICMgKDIxIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEElMEEgICAgICAgICMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0LmF3c19sYXVuY2hfdGVtcGxhdGUuanVtcGhvc3Qgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlJTBBICB+IHJlc291cmNlIFwiYXdzX2xhdW5jaF90ZW1wbGF0ZVwiIFwianVtcGhvc3RcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICA9IFwibHQtMDFhOGVmOTY4MjJiNGIwMGJcIiUwQSAgICAgIH4gbGF0ZXN0X3ZlcnNpb24gICAgICAgICAgPSAyOCAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICBuYW1lICAgICAgICAgICAgICAgICAgICA9IFwianVtcGhvc3QtMjAyMzA3MTAwNDQ5MjY2MDU4MDAwMDAwMDFcIiUwQSAgICAgICAgdGFncyAgICAgICAgICAgICAgICAgICAgPSB7fSUwQSAgICAgIH4gdXNlcl9kYXRhICAgICAgICAgICAgICAgPSBcIlEyOXVkR1Z1ZEMxVWVYQmxPaUJ0ZFd4MGFYQmhjblF2YldsNFpXUTdJR0p2ZFc1a1lYSjVQU0pOU1UxRlFrOVZUa1JCVWxraUNrMUpUVVV0Vm1WeWMybHZiam9nTVM0d0RRb05DaTB0VFVsTlJVSlBWVTVFUVZKWkRRcERiMjUwWlc1MExWUnlZVzV6Wm1WeUxVVnVZMjlrYVc1bk9pQTNZbWwwRFFwRGIyNTBaVzUwTFZSNWNHVTZJSFJsZUhRdlkyeHZkV1F0WTI5dVptbG5EUXBOYVcxbExWWmxjbk5wYjI0NklERXVNQTBLRFFvalkyeHZkV1F0WTI5dVptbG5DaUpoY0hRaU9nb2dJQ0p6YjNWeVkyVnpJam9LSUNBZ0lDSnBibVp5WVdodmRYTmxJam9LSUNBZ0lDQWdJbXRsZVNJNklId0tJQ0FnSUNBZ0lDQXRMUzB0TFVKRlIwbE9JRkJIVUNCUVZVSk1TVU1nUzBWWklFSk1UME5MTFMwdExTMEtDaUFnSUNBZ0lDQWdiVkZKVGtKSFV6ZEdkR3RDUlVGRVJpdFpiVVJuTmxGMmMzWTFWalphVVhjclVXaDRaRlIyYWsxWVpVeERPVlEyVWtaU1ZrUTVORGR4UzNwMFRrNVJiZ29nSUNBZ0lDQWdJQ3RCTDNsNGNISk1RVzFYTWpWVmRTOHhNVzlEYzNwT1ZrbEpZVkl6VDFrNFRYUjVhV3hpUTNSNlZXdENlblpYWkd4WU0waDJWSGM1TVV4d09HSjRWVXdLSUNBZ0lDQWdJQ0JGV0U5Tk9XNXpZM0ZQY2s5MlprSnFZVzV3YkV0RVJVdFFUVmsyZGtsYU0ydHdNWEpWYzBOT1IweENUREI0TWt0YVoxVTRNSFZzVW5OTlRUaHhia0pPQ2lBZ0lDQWdJQ0FnYTNCVWFVRmxXRXRQUlZaMFVucHNWMngyVDBaTVNqZHdXVVIyWVZvd1ZXZElVMVoxUlN0YWEyeGtjVTlrVEV4U2NFdHJaRWwyU2xCamExaHhURFY0VkFvZ0lDQWdJQ0FnSUZWMlYxUlhNV1Z1UmtGSVpEVXJUbEY0VFc1RFlUTnBhMnBSVmpORVZHeEZhbk5uVEV4UlltSjVjMWhxV0ZCeU5sQkpVSE15T1dOVVkyWnZjVFF6TVU4S0lDQWdJQ0FnSUNCMFVqUkVjbHBDTkhaTlJVOUJPRGhVYlV0Q2EwVnBUVWNyYVVJNVkycDZOWGRDU1hWTmRUazFXbTF2U25oa2RtcFFVamN5UmxsTFozSkRXRTUwVG1oa0NpQWdJQ0FnSUNBZ1ZtVnlSVkoyY0V4VWFHUmhVbTFhWjJrM2JIa3JSSFpyV1RkTWNYbEtVSFprU0dOeGVHVmtaMFp1VUV0U05GUXJaMU5SYldKVlVHUTVjWEZrU2xJd1VRb2dJQ0FnSUNBZ0lFdHNMMUJ0ZEhWVEwzYzVaM2t5V2pSaGVUQlJTVXR5VGtKNlVYaG9RVGhNUkZwd2NERnlkV1pEU2pVcldrMWxaamt3ZGtod2QzaE5LMDloVUhKNVRtd0tJQ0FnSUNBZ0lDQkZaRVJYTjFsUk9HWjFRalZ1VUhGcWQxVkJjRzFzV1ZsTVNsbHNaRGQyU2pjNVJVbDRMM05xWjJnMlJ5dEpSbWx0TjNoU04xZHBVVVl2YmtwbGRtWnhDaUFnSUNBZ0lDQWdkbnBaVHpkdmNpOUhTVU5pTm1WYWQzWlFaSFI1TnpsSWJWWmxVSEZGVkd4RVZUQXdiM2x2Y0ZkNVZITlplVk5aUkZOSWJpODBaRzlVZFhnNGRpdEdMd29nSUNBZ0lDQWdJRmxsZVdKMlozRmljbWxJTjJsVFJqaEllSGRGUm1WRWFuSk5kRlZVU0hOWVF6TTFSRWhHWlUxRGFFcHZlSE41UzNZME9Fb3JZa2xIUm5kQlVrRlJRVUlLSUNBZ0lDQWdJQ0IwUXpGS1ltMWFlVmxWYUhaa1dFNXNTVVpDYUZreWRHaGFNbFo1U1VSNGQxbFhUbkpaVjJSc1kydENjR0p0V25sWlYyaDJaRmhPYkV4dFRuWmlWRFpLQ2lBZ0lDQWdJQ0FnUVd4UlJVVjNSVXRCUkRSWFNWRlRhVTVvTld0Wk0zYzRWekJuUVVZNFdHZDFTbUZ2ZUdaalJEZDNWVU5hVEhOWE1sRkpZa0YzVlVwQk9FcHVRVUZWVEFvZ0lDQWdJQ0FnSUVOUlowaEJaMWxXUTJkclNVTjNTVVZHWjBsRVFWRkpaVUZSU1ZoblFVRkxRMUpFWjNWS1lXOTRabU5FTjNkaU4wUXZPV1Z1WW5SUE1VUkZVVzR4VUhRS0lDQWdJQ0FnSUNCb1oydDBTQ3RKY21KQ1pGbFNTR3MzTVdsc01taGlibTFCWW05TWEyc3hZV3N2WVdGUldTOVlVVVJLUm1oeVFUZHFUV3RRVEU5RFVtVnZkRWhwVVcxMkNpQWdJQ0FnSUNBZ01WVm1jVVJqVFRKbFVUUXZlREJPT1VZeVJFeFZVMnQxZDNjeE1UZDJkSFJWYjBKNGFYSkNOekp3VHpCVUwyeGtPVzh6T1ZOSVRVTXZSR1pyTm5rMmFBb2dJQ0FnSUNBZ0lIUlVSM0Y0VEdkb09Hb3pSRk41VHpWRlJYSktUR0V2TTBKMlRYRnlOR2x4WWpOUVZIZE9aVVJTUldwaGRsRkthRmhUZGtWR2FubEJRMjl2T1dRM2NuTUtJQ0FnSUNBZ0lDQTNiR2hEWW1KVFVHcG5WR05ITDFCRFpucE1jak0zVVhsNldHbFVVaTlVZDJwcGQxWmtWR2hrUTFNdlEwdHVjMjlOT0c1blNIaHFXRmx3U3pkTk5uZG5DaUFnSUNBZ0lDQWdkSHBCT0VwclNGcHlOVTF3YTNKUVIzSm5VV1YyYUVwQ1RHdElVaTlxWTNOaFlVSmFUamR1ZHpoaFpVaGpkM2ROTkM5RGFFaEplVnBrVVRreE1EVTVjQW9nSUNBZ0lDQWdJRTlOWVZsdFYyMXFVRkZtY1RGeVQyNUJRWFpCTVhoWGR5dFVXazU2U0dkWFNYRTBkblZ6ZURkUFFuWnlSbk5XWlZwT2MzRmtOMDloTkhCeWRGWlhaekFLSUNBZ0lDQWdJQ0E1TVdOTFdrcHZMMDkyTm05d1RTOTNSRmRPTW5sQ2JtdHRRa04zWVZod2IwZzFUa1JSTWpKaWFHNUhWRXBsU1Zka1pXazRWVk5IY0haQ2ExUjRRa2t5Q2lBZ0lDQWdJQ0FnV0RNeWNIbFBiVnBFYmpneFRESjZUVEpwYjA1MloxaEpZalYxTlhScVlqbE9UMmxCZERadlZ6QkhNSGd3TUdSbmNqTnlObkIxT0hGdFRYZHJRbFpDUXdvZ0lDQWdJQ0FnSUhaWGQwVnRZWGhSYm10VWFHNWlRV1ExTjFaaVlYUTBMeTkxUkdOSVJuQkVZVUpRY0VaWFpVTk1NbVJtUkZOeVV6bHBhVXMyU3pGV2EzWkhURzlZYURnS0lDQWdJQ0FnSUNCTmNFcHhhbTlrWkhCbVRtZzBkWGxtZWt0NVRrVXhaSEpSTWpsdFkzZG1TV3g2V0c5UWNtSXdPVmMyV2tod2JTdDBjV1E0VFdzM01EZDZkM05rUmtkU0NpQWdJQ0FnSUNBZ2NWSnplRzEwVUc0NVNqRnlaVmxhYVZaMVJUVkhNalptTVdGTFZGSTNhME5FVVZKcmRYaGlXa0ZTUVVFMEt6bHJialJ6YlVKWVdtTk5NSFpHY1RsU09Bb2dJQ0FnSUNBZ0lESTBXRXRhZEZSaFZtMVdiMVpLVFZKUlRUUTBjVmRTSzNNdlV6Qk5lblppVHpWMU1HTlRWbFJvV1RZMVdYcE5USE01TWpCVldUWjFSM0J2VXpKYVdYY0tJQ0FnSUNBZ0lDQkpUV2x3YTJGQ0t6SkdOa0k0VWpkV04yNXNMMU5uWVZoSFlUSk5aWGhyUXpkM2REWmliRVppWVhjM2NHSjJTU3RwU1RsM1V6aENTMGhuVFVSNlpEQkdDaUFnSUNBZ0lDQWdWR3BUY1RsMlpHdFdhMlkzZVVremFFVjNiR3hZTjNwVU5rbE1UM1pyYms1SFltOXpNR1JHU1RreVkwSlhVWE1yYVZoUU5UQjRSRlpwZERNck9XMURSQW9nSUNBZ0lDQWdJSEoxVjFaWmF6Y3piWFpUUlhwR1kzVllRM2xpUzBvMVZTOXVlbE5STnpCS2IxRnRVMUJqTlRCU1VXcDFTRWRrZW13dldYcEhSbUZHYmpWNlNWbzFjRkFLSUNBZ0lDQWdJQ0JyTlZNclMxUlpaV3Q2WTJsU2EwaDZZbVZoTlZCcUswRTJTMXBwYkV0cU5YbHJRVkpHZW5jclExQjRjWE4xWldwRWEyazNRU3RoTTIwelYwZHhLMjF0Q2lBZ0lDQWdJQ0FnUVd0c1VUUlpRbU52YkhwT1QzQm5WMk5zU1ZOMVJUTmtOV3RuZEdGS1FVTkpaM1JsT0RkR05sRkNRbk5yT0c5RVFrWlJRMjVhYlc5UGFYSnNVMnhpWmdvZ0lDQWdJQ0FnSUVwMVJEWm1Wa05LZFRKNldUZFVhRTR4VHpCdlYxUjNRV0ZPUVhaTk5UVkRURlIyTm5NelJtMTBVamt5Ykc1c1VVUkdkVW9yWm1vNE5qTmpObkY0TVRRS0lDQWdJQ0FnSUNCR2RVODBiVTAzWlhWVE1EaDNSMmRXUjIwNU1YZEJOMkpaYkRSaGFIaERObE15UWtkQ05VWjJhMXBtZWtKQ2QycHpabTFWVjBoQmRUZFdVbHBLZUd0WUNpQWdJQ0FnSUNBZ1NuQTJPVFpQVkdSU00xSm1TVGRKV2paUFZ6WjBSMFZNYVdwemQxZGlZbHBZWWpWWVVsZEZWems1ZGxkUE4wNUpTelp6VDNab1RVUk9jRGxpVTAxMVlnb2dJQ0FnSUNBZ0lGaFFNMUJpVUhobmVWUXdZbTF6Y3pCNWQwNVpkM1ZqYm1aamJVUlljVkJXZFROSFpIUTFNMkYwTVN0b1N6ZHRiRzVSTTNWVmN6VmxWa1ZQU1VodVNtMEtJQ0FnSUNBZ0lDQm1NWFJ5UkdkblUxUkZOMlp1YTNnMlEzcHNLMmxOYTBGRlVVVkJRVmxyUTFCQlVWbEJVVzlCU21oWmFFSkxTVEpJYlZKcVprUjRZbE5CUVZoNFpVTTBDaUFnSUNBZ0lDQWdiSEZxUmpsM1VIWkNVVXByZFhoaVdrRm9jMDFDVVd0RWQyMWpRVUZCYjBwRlQwTTBiSEZxUmpsM1VIWTRVMUZRTDJwelVXWktRMVZJY21wd1dEUm1VQW9nSUNBZ0lDQWdJREJPZEZaNWNXeERjbkV4VDIxTVVEZENUSEpZY2tONGIwRkdVbUkyTkZsS1ZXUlhhelZRTXpWck9YZHFNa0pSYW5CcVkwNXFNbWxyT0RCR2IyOHdNa1VLSUNBZ0lDQWdJQ0I1WXl0UWVsY3ZOSFI2Vm5aa2VGSnlSWHB6VDBadEsyMU5VaXRzYkZWSVFVdDZRbUUyVVVKNFNGUXdiMlpNTjNBMVdGbFVkVTFPYmxsdksxQnFWazF0Q2lBZ0lDQWdJQ0FnYWxBelZFVktSMWxZV1cxMWFFZG1ZV0ZLV25CcVRHMUtSbkZ3TlRsNEx5OWtjMDFJWlV4eFZVTm9kMkkyUTJjMlJIVnJRV2xvWlVGek0xQXJjbGh2TXdvZ0lDQWdJQ0FnSUhSQ2JrRTBTa05EYVZoU055OHZNRmRsZWxKdlUxQmtZV3hPWlcwMGRuTTRVRlE0TjNOdVNHSkViR2xHVFZabU9IY3JabXR6U1c1eGRtOTBhVkpFU1RRS0lDQWdJQ0FnSUNCUlFuSkNabk16VG1SbFdsY3ZkRzExY0U5aFdrcFNla2hFZG5aTFltY3ZMMDgyYVhBeFlWQjJTVXhYZGxSRVRUaExZMUZEVVVWVFlWZHJRMkpKTVhWakNpQWdJQ0FnSUNBZ2NtbDZRVTFpYkZSQ01tZDVkemw1YjJwRGNGWkRUVUpZWkdsNlFYRnhlV3cxV2xaeWR6UXJXQzlwTURsSmMwNTBPR2hCT1M4MVVsazNkak5qTjFveVF3b2dJQ0FnSUNBZ0lGaDVNbmhMVjIxMFRFazVibXhQVTFOM1ZYaENOVFkyU1RJNWJGWkxRa3hWYlZodFVXWnVVa2xKU0VOcFNrUllXVVpFVUM4MlRHWjJPU3R0YUVWWFZUZ0tJQ0FnSUNBZ0lDQnhaV1F6ZUdod1pVNVRRVWw2UVN0TlZHeHFkR2xTYlc5eWVIQmtaR2xZWW5SRFlXWmpVR3d2U2pOWU1FSXdOMlpqWTBwYWQxcHpRMWxEY0hSTWVURmpDaUFnSUNBZ0lDQWdlWFpXWVU0clJVSnRhbTlEY0ROcWREWjNUR1UwZUdOc2NWVXpRVU4zZWk4NFZFUkViWFJLTjFWVlpHdzNUV1JyYVhCUldqSTNPRXd5YTNCc05tODJNUW9nSUNBZ0lDQWdJRTFHTW1aWVJEZG1XazFsV21aRmR6WnNkVEJDUmpWdFdqQXZZMmd6U0hoWVpWcHZXR2xtTnpsbk1qVjJXbTFUWkZjNU4zQmpaV1YzVUd4MmJFVlVSbEVLSUNBZ0lDQWdJQ0ExTlhCTmIzSlJlVlZVUlZGRFVUTkZRM3BJV1ZOdVRDOVViVmMzQ2lBZ0lDQWdJQ0FnUFNzd1VtTUtJQ0FnSUNBZ0lDQXRMUzB0TFVWT1JDQlFSMUFnVUZWQ1RFbERJRXRGV1NCQ1RFOURTeTB0TFMwdENpQWdJQ0FnSUNKemIzVnlZMlVpT2lBaVpHVmlJRnR6YVdkdVpXUXRZbms5SkV0RldWOUdTVXhGWFNCb2RIUndjem92TDNKbGJHVmhjMlV0YW1GdGJYa3VhVzVtY21Gb2IzVnpaUzVqYjIwdklDUlNSVXhGUVZORkNpQWdJQ0FnSUNBZ2JXRnBiaUlLSW5CaFkydGhaMlZmZFhCa1lYUmxJam9nZEhKMVpRb2ljR0ZqYTJGblpYTWlPZ290SUNKd2RYQndaWFF0WTI5a1pTSUtMU0FpYVc1bWNtRm9iM1Z6WlMxMGIyOXNhMmwwSWdvaWNIVndjR1YwSWpvS0lDQWlZMjlzYkdWamRHbHZiaUk2SUNKd2RYQndaWFE0SWdvZ0lDSnBibk4wWVd4c0lqb2dkSEoxWlFvZ0lDSnBibk4wWVd4c1gzUjVjR1VpT2lBaVlXbHZJZ29nSUNKd1lXTnJZV2RsWDI1aGJXVWlPaUFpY0hWd2NHVjBMV0ZuWlc1MElnb2dJQ0p6ZEdGeWRGOXpaWEoyYVdObElqb2dabUZzYzJVS0luSjFibU50WkNJNkNpMGdMU0FpYVdndGNIVndjR1YwSWdvZ0lDMGdJaTB0WkdWaWRXY2lDaUFnTFNBaVlYQndiSGtpQ2lKM2NtbDBaVjltYVd4bGN5STZDaTBnSW1OdmJuUmxiblFpT2lCOExRb2dJQ0FnVzJSbFptRjFiSFJkQ2lBZ0lDQnlaV2RwYjI0OWRYTXRkMlZ6ZEMweENpQWdJbkJoZEdnaU9pQWlMM0p2YjNRdkxtRjNjeTlqYjI1bWFXY2lDaUFnSW5CbGNtMXBjM05wYjI1eklqb2dJakEyTURBaUNpMGdJbU52Ym5SbGJuUWlPaUI4Q2lBZ0lDQWljSFZ3Y0dWMFgyVnVkbWx5YjI1dFpXNTBJam9nSW5CeWIyUjFZM1JwYjI0aUNpQWdJQ0FpY0hWd2NHVjBYM0p2YkdVaU9pQWlhblZ0Y0dodmMzUWlDaUFnSW5CaGRHZ2lPaUFpTDJWMFl5OXdkWEJ3WlhSc1lXSnpMMlpoWTNSbGNpOW1ZV04wY3k1a0wzQjFjSEJsZEM1NVlXMXNJZ29nSUNKd1pYSnRhWE56YVc5dWN5STZJQ0l3TmpRMElnb05DaTB0VFVsTlJVSlBWVTVFUVZKWkxTME5DZz09XCIgLT4gXCJRMjl1ZEdWdWRDMVVlWEJsT2lCdGRXeDBhWEJoY25RdmJXbDRaV1E3SUdKdmRXNWtZWEo1UFNKTlNVMUZRazlWVGtSQlVsa2lDazFKVFVVdFZtVnljMmx2YmpvZ01TNHdEUW9OQ2kwdFRVbE5SVUpQVlU1RVFWSlpEUXBEYjI1MFpXNTBMVlJ5WVc1elptVnlMVVZ1WTI5a2FXNW5PaUEzWW1sMERRcERiMjUwWlc1MExWUjVjR1U2SUhSbGVIUXZZMnh2ZFdRdFkyOXVabWxuRFFwTmFXMWxMVlpsY25OcGIyNDZJREV1TUEwS0RRb2pZMnh2ZFdRdFkyOXVabWxuQ2lKaGNIUWlPZ29nSUNKemIzVnlZMlZ6SWpvS0lDQWdJQ0pwYm1aeVlXaHZkWE5sSWpvS0lDQWdJQ0FnSW10bGVTSTZJSHdLSUNBZ0lDQWdJQ0F0TFMwdExVSkZSMGxPSUZCSFVDQlFWVUpNU1VNZ1MwVlpJRUpNVDBOTExTMHRMUzBLQ2lBZ0lDQWdJQ0FnYlZGSlRrSkhVemRHZEd0Q1JVRkVSaXRaYlVSbk5sRjJjM1kxVmpaYVVYY3JVV2g0WkZSMmFrMVlaVXhET1ZRMlVrWlNWa1E1TkRkeFMzcDBUazVSYmdvZ0lDQWdJQ0FnSUN0QkwzbDRjSEpNUVcxWE1qVlZkUzh4TVc5RGMzcE9Wa2xKWVZJelQxazRUWFI1YVd4aVEzUjZWV3RDZW5aWFpHeFlNMGgyVkhjNU1VeHdPR0o0VlV3S0lDQWdJQ0FnSUNCRldFOU5PVzV6WTNGUGNrOTJaa0pxWVc1d2JFdEVSVXRRVFZrMmRrbGFNMnR3TVhKVmMwTk9SMHhDVERCNE1rdGFaMVU0TUhWc1VuTk5UVGh4YmtKT0NpQWdJQ0FnSUNBZ2EzQlVhVUZsV0V0UFJWWjBVbnBzVjJ4MlQwWk1TamR3V1VSMllWb3dWV2RJVTFaMVJTdGFhMnhrY1U5a1RFeFNjRXRyWkVsMlNsQmphMWh4VERWNFZBb2dJQ0FnSUNBZ0lGVjJWMVJYTVdWdVJrRklaRFVyVGxGNFRXNURZVE5wYTJwUlZqTkVWR3hGYW5OblRFeFJZbUo1YzFocVdGQnlObEJKVUhNeU9XTlVZMlp2Y1RRek1VOEtJQ0FnSUNBZ0lDQjBValJFY2xwQ05IWk5SVTlCT0RoVWJVdENhMFZwVFVjcmFVSTVZMnA2TlhkQ1NYVk5kVGsxV20xdlNuaGtkbXBRVWpjeVJsbExaM0pEV0U1MFRtaGtDaUFnSUNBZ0lDQWdWbVZ5UlZKMmNFeFVhR1JoVW0xYVoyazNiSGtyUkhacldUZE1jWGxLVUhaa1NHTnhlR1ZrWjBadVVFdFNORlFyWjFOUmJXSlZVR1E1Y1hGa1NsSXdVUW9nSUNBZ0lDQWdJRXRzTDFCdGRIVlRMM2M1WjNreVdqUmhlVEJSU1V0eVRrSjZVWGhvUVRoTVJGcHdjREZ5ZFdaRFNqVXJXazFsWmprd2RraHdkM2hOSzA5aFVISjVUbXdLSUNBZ0lDQWdJQ0JGWkVSWE4xbFJPR1oxUWpWdVVIRnFkMVZCY0cxc1dWbE1TbGxzWkRkMlNqYzVSVWw0TDNOcVoyZzJSeXRKUm1sdE4zaFNOMWRwVVVZdmJrcGxkbVp4Q2lBZ0lDQWdJQ0FnZG5wWlR6ZHZjaTlIU1VOaU5tVmFkM1pRWkhSNU56bEliVlpsVUhGRlZHeEVWVEF3YjNsdmNGZDVWSE5aZVZOWlJGTkliaTgwWkc5VWRYZzRkaXRHTHdvZ0lDQWdJQ0FnSUZsbGVXSjJaM0ZpY21sSU4ybFRSamhJZUhkRlJtVkVhbkpOZEZWVVNITllRek0xUkVoR1pVMURhRXB2ZUhONVMzWTBPRW9yWWtsSFJuZEJVa0ZSUVVJS0lDQWdJQ0FnSUNCMFF6RktZbTFhZVZsVmFIWmtXRTVzU1VaQ2FGa3lkR2hhTWxaNVNVUjRkMWxYVG5KWlYyUnNZMnRDY0dKdFdubFpWMmgyWkZoT2JFeHRUblppVkRaS0NpQWdJQ0FnSUNBZ1FXeFJSVVYzUlV0QlJEUlhTVkZUYVU1b05XdFpNM2M0VnpCblFVWTRXR2QxU21GdmVHWmpSRGQzVlVOYVRITlhNbEZKWWtGM1ZVcEJPRXB1UVVGVlRBb2dJQ0FnSUNBZ0lFTlJaMGhCWjFsV1EyZHJTVU4zU1VWR1owbEVRVkZKWlVGUlNWaG5RVUZMUTFKRVozVktZVzk0Wm1ORU4zZGlOMFF2T1dWdVluUlBNVVJGVVc0eFVIUUtJQ0FnSUNBZ0lDQm9aMnQwU0N0SmNtSkNaRmxTU0dzM01XbHNNbWhpYm0xQlltOU1hMnN4WVdzdllXRlJXUzlZVVVSS1JtaHlRVGRxVFd0UVRFOURVbVZ2ZEVocFVXMTJDaUFnSUNBZ0lDQWdNVlZtY1VSalRUSmxVVFF2ZURCT09VWXlSRXhWVTJ0MWQzY3hNVGQyZEhSVmIwSjRhWEpDTnpKd1R6QlVMMnhrT1c4ek9WTklUVU12Ukdack5uazJhQW9nSUNBZ0lDQWdJSFJVUjNGNFRHZG9PR296UkZONVR6VkZSWEpLVEdFdk0wSjJUWEZ5TkdseFlqTlFWSGRPWlVSU1JXcGhkbEZLYUZoVGRrVkdhbmxCUTI5dk9XUTNjbk1LSUNBZ0lDQWdJQ0EzYkdoRFltSlRVR3BuVkdOSEwxQkRabnBNY2pNM1VYbDZXR2xVVWk5VWQycHBkMVprVkdoa1ExTXZRMHR1YzI5Tk9HNW5TSGhxV0Zsd1N6ZE5ObmRuQ2lBZ0lDQWdJQ0FnZEhwQk9FcHJTRnB5TlUxd2EzSlFSM0puVVdWMmFFcENUR3RJVWk5cVkzTmhZVUphVGpkdWR6aGhaVWhqZDNkTk5DOURhRWhKZVZwa1VUa3hNRFU1Y0FvZ0lDQWdJQ0FnSUU5TllWbHRWMjFxVUZGbWNURnlUMjVCUVhaQk1YaFhkeXRVV2s1NlNHZFhTWEUwZG5WemVEZFBRblp5Um5OV1pWcE9jM0ZrTjA5aE5IQnlkRlpYWnpBS0lDQWdJQ0FnSUNBNU1XTkxXa3B2TDA5Mk5tOXdUUzkzUkZkT01ubENibXR0UWtOM1lWaHdiMGcxVGtSUk1qSmlhRzVIVkVwbFNWZGtaV2s0VlZOSGNIWkNhMVI0UWtreUNpQWdJQ0FnSUNBZ1dETXljSGxQYlZwRWJqZ3hUREo2VFRKcGIwNTJaMWhKWWpWMU5YUnFZamxPVDJsQmREWnZWekJITUhnd01HUm5jak55Tm5CMU9IRnRUWGRyUWxaQ1F3b2dJQ0FnSUNBZ0lIWlhkMFZ0WVhoUmJtdFVhRzVpUVdRMU4xWmlZWFEwTHk5MVJHTklSbkJFWVVKUWNFWlhaVU5NTW1SbVJGTnlVemxwYVVzMlN6RldhM1pIVEc5WWFEZ0tJQ0FnSUNBZ0lDQk5jRXB4YW05a1pIQm1UbWcwZFhsbWVrdDVUa1V4WkhKUk1qbHRZM2RtU1d4NldHOVFjbUl3T1ZjMldraHdiU3QwY1dRNFRXczNNRGQ2ZDNOa1JrZFNDaUFnSUNBZ0lDQWdjVkp6ZUcxMFVHNDVTakZ5WlZsYWFWWjFSVFZITWpabU1XRkxWRkkzYTBORVVWSnJkWGhpV2tGU1FVRTBLemxyYmpSemJVSllXbU5OTUhaR2NUbFNPQW9nSUNBZ0lDQWdJREkwV0V0YWRGUmhWbTFXYjFaS1RWSlJUVFEwY1ZkU0szTXZVekJOZW5aaVR6VjFNR05UVmxSb1dUWTFXWHBOVEhNNU1qQlZXVFoxUjNCdlV6SmFXWGNLSUNBZ0lDQWdJQ0JKVFdsd2EyRkNLekpHTmtJNFVqZFdOMjVzTDFObllWaEhZVEpOWlhoclF6ZDNkRFppYkVaaVlYYzNjR0oyU1N0cFNUbDNVemhDUzBoblRVUjZaREJHQ2lBZ0lDQWdJQ0FnVkdwVGNUbDJaR3RXYTJZM2VVa3phRVYzYkd4WU4zcFVOa2xNVDNacmJrNUhZbTl6TUdSR1NUa3lZMEpYVVhNcmFWaFFOVEI0UkZacGRETXJPVzFEUkFvZ0lDQWdJQ0FnSUhKMVYxWlphemN6YlhaVFJYcEdZM1ZZUTNsaVMwbzFWUzl1ZWxOUk56QktiMUZ0VTFCak5UQlNVV3AxU0Vka2Vtd3ZXWHBIUm1GR2JqVjZTVm8xY0ZBS0lDQWdJQ0FnSUNCck5WTXJTMVJaWld0NlkybFNhMGg2WW1WaE5WQnFLMEUyUzFwcGJFdHFOWGxyUVZKR2VuY3JRMUI0Y1hOMVpXcEVhMmszUVN0aE0yMHpWMGR4SzIxdENpQWdJQ0FnSUNBZ1FXdHNVVFJaUW1OdmJIcE9UM0JuVjJOc1NWTjFSVE5rTld0bmRHRktRVU5KWjNSbE9EZEdObEZDUW5Ock9HOUVRa1pSUTI1YWJXOVBhWEpzVTJ4aVpnb2dJQ0FnSUNBZ0lFcDFSRFptVmtOS2RUSjZXVGRVYUU0eFR6QnZWMVIzUVdGT1FYWk5OVFZEVEZSMk5uTXpSbTEwVWpreWJHNXNVVVJHZFVvclptbzROak5qTm5GNE1UUUtJQ0FnSUNBZ0lDQkdkVTgwYlUwM1pYVlRNRGgzUjJkV1IyMDVNWGRCTjJKWmJEUmhhSGhETmxNeVFrZENOVVoyYTFwbWVrSkNkMnB6Wm0xVlYwaEJkVGRXVWxwS2VHdFlDaUFnSUNBZ0lDQWdTbkEyT1RaUFZHUlNNMUptU1RkSldqWlBWelowUjBWTWFXcHpkMWRpWWxwWVlqVllVbGRGVnprNWRsZFBOMDVKU3paelQzWm9UVVJPY0RsaVUwMTFZZ29nSUNBZ0lDQWdJRmhRTTFCaVVIaG5lVlF3WW0xemN6QjVkMDVaZDNWamJtWmpiVVJZY1ZCV2RUTkhaSFExTTJGME1TdG9TemR0Ykc1Uk0zVlZjelZsVmtWUFNVaHVTbTBLSUNBZ0lDQWdJQ0JtTVhSeVJHZG5VMVJGTjJadWEzZzJRM3BzSzJsTmEwRkZVVVZCUVZsclExQkJVVmxCVVc5QlNtaFphRUpMU1RKSWJWSnFaa1I0WWxOQlFWaDRaVU0wQ2lBZ0lDQWdJQ0FnYkhGcVJqbDNVSFpDVVVwcmRYaGlXa0ZvYzAxQ1VXdEVkMjFqUVVGQmIwcEZUME0wYkhGcVJqbDNVSFk0VTFGUUwycHpVV1pLUTFWSWNtcHdXRFJtVUFvZ0lDQWdJQ0FnSURCT2RGWjVjV3hEY25FeFQyMU1VRGRDVEhKWWNrTjRiMEZHVW1JMk5GbEtWV1JYYXpWUU16VnJPWGRxTWtKUmFuQnFZMDVxTW1sck9EQkdiMjh3TWtVS0lDQWdJQ0FnSUNCNVl5dFFlbGN2TkhSNlZuWmtlRkp5UlhwelQwWnRLMjFOVWl0c2JGVklRVXQ2UW1FMlVVSjRTRlF3YjJaTU4zQTFXRmxVZFUxT2JsbHZLMUJxVmsxdENpQWdJQ0FnSUNBZ2FsQXpWRVZLUjFsWVdXMTFhRWRtWVdGS1duQnFURzFLUm5Gd05UbDRMeTlrYzAxSVpVeHhWVU5vZDJJMlEyYzJSSFZyUVdsb1pVRnpNMUFyY2xodk13b2dJQ0FnSUNBZ0lIUkNia0UwU2tORGFWaFNOeTh2TUZkbGVsSnZVMUJrWVd4T1pXMDBkbk00VUZRNE4zTnVTR0pFYkdsR1RWWm1PSGNyWm10elNXNXhkbTkwYVZKRVNUUUtJQ0FnSUNBZ0lDQlJRbkpDWm5NelRtUmxXbGN2ZEcxMWNFOWhXa3BTZWtoRWRuWkxZbWN2TDA4MmFYQXhZVkIyU1V4WGRsUkVUVGhMWTFGRFVVVlRZVmRyUTJKSk1YVmpDaUFnSUNBZ0lDQWdjbWw2UVUxaWJGUkNNbWQ1ZHpsNWIycERjRlpEVFVKWVpHbDZRWEZ4ZVd3MVdsWnlkelFyV0M5cE1EbEpjMDUwT0doQk9TODFVbGszZGpOak4xb3lRd29nSUNBZ0lDQWdJRmg1TW5oTFYyMTBURWs1Ym14UFUxTjNWWGhDTlRZMlNUSTViRlpMUWt4VmJWaHRVV1p1VWtsSlNFTnBTa1JZV1VaRVVDODJUR1oyT1N0dGFFVlhWVGdLSUNBZ0lDQWdJQ0J4WldRemVHaHdaVTVUUVVsNlFTdE5WR3hxZEdsU2JXOXllSEJrWkdsWVluUkRZV1pqVUd3dlNqTllNRUl3TjJaalkwcGFkMXB6UTFsRGNIUk1lVEZqQ2lBZ0lDQWdJQ0FnZVhaV1lVNHJSVUp0YW05RGNETnFkRFozVEdVMGVHTnNjVlV6UVVOM2VpODRWRVJFYlhSS04xVlZaR3czVFdScmFYQlJXakkzT0V3eWEzQnNObTgyTVFvZ0lDQWdJQ0FnSUUxR01tWllSRGRtV2sxbFdtWkZkelpzZFRCQ1JqVnRXakF2WTJnelNIaFlaVnB2V0dsbU56bG5NalYyV20xVFpGYzVOM0JqWldWM1VHeDJiRVZVUmxFS0lDQWdJQ0FnSUNBMU5YQk5iM0pSZVZWVVJWRkRVVE5GUTNwSVdWTnVUQzlVYlZjM0NpQWdJQ0FnSUNBZ1BTc3dVbU1LSUNBZ0lDQWdJQ0F0TFMwdExVVk9SQ0JRUjFBZ1VGVkNURWxESUV0RldTQkNURTlEU3kwdExTMHRDaUFnSUNBZ0lDSnpiM1Z5WTJVaU9pQWlaR1ZpSUZ0emFXZHVaV1F0WW5rOUpFdEZXVjlHU1V4RlhTQm9kSFJ3Y3pvdkwzSmxiR1ZoYzJVdGFtRnRiWGt1YVc1bWNtRm9iM1Z6WlM1amIyMHZJQ1JTUlV4RlFWTkZDaUFnSUNBZ0lDQWdiV0ZwYmlJS0luQmhZMnRoWjJWZmRYQmtZWFJsSWpvZ2RISjFaUW9pY0dGamEyRm5aWE1pT2dvdElDSndkWEJ3WlhRdFkyOWtaU0lLTFNBaWFXNW1jbUZvYjNWelpTMTBiMjlzYTJsMElnb2ljSFZ3Y0dWMElqb0tJQ0FpWTI5c2JHVmpkR2x2YmlJNklDSndkWEJ3WlhRNElnb2dJQ0pwYm5OMFlXeHNJam9nZEhKMVpRb2dJQ0pwYm5OMFlXeHNYM1I1Y0dVaU9pQWlZV2x2SWdvZ0lDSndZV05yWVdkbFgyNWhiV1VpT2lBaWNIVndjR1YwTFdGblpXNTBJZ29nSUNKemRHRnlkRjl6WlhKMmFXTmxJam9nWm1Gc2MyVUtJbkoxYm1OdFpDSTZDaTBnTFNBaWFXZ3RjSFZ3Y0dWMElnb2dJQzBnSWkwdFpXNTJhWEp2Ym0xbGJuUWlDaUFnTFNBaWNISnZaSFZqZEdsdmJpSUtJQ0F0SUNJdExYSnZiM1F0WkdseVpXTjBiM0o1SWdvZ0lDMGdJaTl2Y0hRdmNIVndjR1YwTFdOdlpHVWlDaUFnTFNBaUxTMW9hV1Z5WVMxamIyNW1hV2NpQ2lBZ0xTQWllM0p2YjNSZlpHbHlaV04wYjNKNWZTOWxiblpwY205dWJXVnVkSE12ZTJWdWRtbHliMjV0Wlc1MGZTOW9hV1Z5WVM1NVlXMXNJZ29nSUMwZ0lpMHRiVzlrZFd4bExYQmhkR2dpQ2lBZ0xTQWllM0p2YjNSZlpHbHlaV04wYjNKNWZTOXRiMlIxYkdWeklnb2dJQzBnSW1Gd2NHeDVJZ29pZDNKcGRHVmZabWxzWlhNaU9nb3RJQ0pqYjI1MFpXNTBJam9nZkMwS0lDQWdJRnRrWldaaGRXeDBYUW9nSUNBZ2NtVm5hVzl1UFhWekxYZGxjM1F0TVFvZ0lDSndZWFJvSWpvZ0lpOXliMjkwTHk1aGQzTXZZMjl1Wm1sbklnb2dJQ0p3WlhKdGFYTnphVzl1Y3lJNklDSXdOakF3SWdvdElDSmpiMjUwWlc1MElqb2dmQW9nSUNBZ0luQjFjSEJsZEY5bGJuWnBjbTl1YldWdWRDSTZJQ0p3Y205a2RXTjBhVzl1SWdvZ0lDQWdJbkIxY0hCbGRGOXliMnhsSWpvZ0ltcDFiWEJvYjNOMElnb2dJQ0p3WVhSb0lqb2dJaTlsZEdNdmNIVndjR1YwYkdGaWN5OW1ZV04wWlhJdlptRmpkSE11WkM5d2RYQndaWFF1ZVdGdGJDSUtJQ0FpY0dWeWJXbHpjMmx2Ym5NaU9pQWlNRFkwTkNJS0RRb3RMVTFKVFVWQ1QxVk9SRUZTV1MwdERRbz1cIiUwQSAgICAgICAgIyAoMTEgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSUwQSAgICAgICAgIyAoMSB1bmNoYW5nZWQgYmxvY2sgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfczNfb2JqZWN0LmxhbWJkYV9wYWNrYWdlIG11c3QgYmUgcmVwbGFjZWQlMEEtLysgcmVzb3VyY2UgXCJhd3NfczNfb2JqZWN0XCIgXCJsYW1iZGFfcGFja2FnZVwiIHslMEEgICAgICArIGFjbCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBidWNrZXRfa2V5X2VuYWJsZWQgICAgID0gZmFsc2UgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY2hlY2tzdW1fY3JjMzIgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNoZWNrc3VtX2NyYzMyYyAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBjaGVja3N1bV9zaGExICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY2hlY2tzdW1fc2hhMjU2ICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGNvbnRlbnRfdHlwZSAgICAgICAgICAgPSBcImJpbmFyeS9vY3RldC1zdHJlYW1cIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBldGFnICAgICAgICAgICAgICAgICAgID0gXCJhMTAzMTFmYTk2ZTU5YTdiMTk5YzJiOGViMWIwNDFiOS0zXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gaWQgICAgICAgICAgICAgICAgICAgICA9IFwiM2FhNzM4ZjAtMjI3ZC02ZjA2LTExYTUtYzE3NTQ0MjhjYmRiLnppcFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGtleSAgICAgICAgICAgICAgICAgICAgPSBcIjNhYTczOGYwLTIyN2QtNmYwNi0xMWE1LWMxNzU0NDI4Y2JkYi56aXBcIiAjIGZvcmNlcyByZXBsYWNlbWVudCAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpICMgZm9yY2VzIHJlcGxhY2VtZW50JTBBICAgICAgKyBrbXNfa2V5X2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIC0gbWV0YWRhdGEgICAgICAgICAgICAgICA9IHt9IC0+IG51bGwlMEEgICAgICB+IHNlcnZlcl9zaWRlX2VuY3J5cHRpb24gPSBcIkFFUzI1NlwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IHNvdXJjZSAgICAgICAgICAgICAgICAgPSBcIm1vZHVsZXMvanVtcGhvc3QvM2FhNzM4ZjAtMjI3ZC02ZjA2LTExYTUtYzE3NTQ0MjhjYmRiLnppcFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IHN0b3JhZ2VfY2xhc3MgICAgICAgICAgPSBcIlNUQU5EQVJEXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGwlMEEgICAgICArIHZlcnNpb25faWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAjICgzIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QubnVsbF9yZXNvdXJjZS5pbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXMgbXVzdCBiZSByZXBsYWNlZCUwQS0vKyByZXNvdXJjZSBcIm51bGxfcmVzb3VyY2VcIiBcImluc3RhbGxfcHl0aG9uX2RlcGVuZGVuY2llc1wiIHslMEEgICAgICB+IGlkICAgICAgID0gXCI0MTI5NTg1MDk2NzU4MjU5NzQ1XCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gdHJpZ2dlcnMgPSB7ICMgZm9yY2VzIHJlcGxhY2VtZW50JTBBICAgICAgICAgIH4gXCJkZXBlbmRlbmNpZXNfdmVyc2lvblwiID0gXCI3Y2I4MTNjNGVlNWI0MGI3N2ViOThjMTQ3NDlmMGZkY1wiIC0+IFwiNzE1YTBmNzMxMGFlNGRhYmY5YjcxMDgwMjMzOWRjZDVcIiUwQSAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGVsZW1lbnQgaGlkZGVuKSUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5yYW5kb21fdXVpZC5sYW1kYV9zcmNfaGFzaCBtdXN0IGJlIHJlcGxhY2VkJTBBLS8rIHJlc291cmNlIFwicmFuZG9tX3V1aWRcIiBcImxhbWRhX3NyY19oYXNoXCIgeyUwQSAgICAgIH4gaWQgICAgICA9IFwiM2FhNzM4ZjAtMjI3ZC02ZjA2LTExYTUtYzE3NTQ0MjhjYmRiXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4ga2VlcGVycyA9IHsgIyBmb3JjZXMgcmVwbGFjZW1lbnQlMEEgICAgICAgICAgfiBcInJlcXVpcmVtZW50cy50eHRcIiA9IFwiN2NiODEzYzRlZTViNDBiNzdlYjk4YzE0NzQ5ZjBmZGNcIiAtPiBcIjcxNWEwZjczMTBhZTRkYWJmOWI3MTA4MDIzMzlkY2Q1XCIlMEEgICAgICAgICAgICAjICgxIHVuY2hhbmdlZCBlbGVtZW50IGhpZGRlbiklMEEgICAgICAgIH0lMEEgICAgICB+IHJlc3VsdCAgPSBcIjNhYTczOGYwLTIyN2QtNmYwNi0xMWE1LWMxNzU0NDI4Y2JkYlwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmV4dHJhW1wicmVxdWlyZWRcIl0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJleHRyYVwiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm9sZSAgICAgICA9IFwianVtcGhvc3QyMDIzMDcxMDA0MzA0NDc2MTAwMDAwMDAwMlwiJTBBICAgIH0lMEElMEFQbGFuOiA1IHRvIGFkZCwgNCB0byBjaGFuZ2UsIDMgdG8gZGVzdHJveS4lMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMFxuIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogNSwgImNoYW5nZSI6IDQsICJkZXN0cm95IjogM319```
</p></details>